-- phpMyAdmin SQL Dump
-- version 3.5.1
-- http://www.phpmyadmin.net
--
-- Хост: 127.0.0.1
-- Время создания: Окт 20 2020 г., 01:49
-- Версия сервера: 5.5.25
-- Версия PHP: 5.3.13

SET SQL_MODE="NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;

--
-- База данных: `rcrp`
--

-- --------------------------------------------------------

--
-- Структура таблицы `accounts`
--

CREATE TABLE IF NOT EXISTS `accounts` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `login` varchar(64) NOT NULL,
  `password` varchar(128) NOT NULL,
  `email` varchar(255) NOT NULL,
  `secret` varchar(128) NOT NULL,
  `admin` int(1) NOT NULL,
  `admin_code` varchar(65) NOT NULL,
  `developer` int(1) NOT NULL,
  `helper` int(1) NOT NULL,
  `last_game_ip` varchar(24) NOT NULL DEFAULT '-',
  `last_ucp_ip` varchar(24) NOT NULL,
  `reg_date` varchar(24) NOT NULL,
  `reg_ip` varchar(24) NOT NULL,
  `last_game_login` varchar(24) NOT NULL DEFAULT '-',
  `last_ucp_login` varchar(24) NOT NULL,
  `donate` int(11) NOT NULL,
  `forumlink` char(3) NOT NULL,
  `about` text NOT NULL,
  `name_changes` int(11) NOT NULL,
  `number_changes` int(11) NOT NULL,
  `google_auth` varchar(17) NOT NULL DEFAULT '!',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB  DEFAULT CHARSET=utf8 AUTO_INCREMENT=87 ;

--
-- Дамп данных таблицы `accounts`
--

INSERT INTO `accounts` (`id`, `login`, `password`, `email`, `secret`, `admin`, `admin_code`, `developer`, `helper`, `last_game_ip`, `last_ucp_ip`, `reg_date`, `reg_ip`, `last_game_login`, `last_ucp_login`, `donate`, `forumlink`, `about`, `name_changes`, `number_changes`, `google_auth`) VALUES
(1, 'jewking', 'fd9d94340dbd72c11b37ebb0d2a19b4d05e00fd78e4e2ce8923b9ea3a54e900df181cfb112a8a73228d1f3551680e2ad9701a4fcfb248fa7fa77b95180628bb2', 'csl1139753@gmail.com', '123123', 5, 'EC44F748F346EB147C652F70A2FC13164AFFCF19D704458E9FD96B5DDF9E1914', 1, 1, '5.16.123.213', '5.16.113.50', '07/05/2020, 03:50', '5.43.241.29', '08/10/2020, 07:10:10', '21/08/2020, 02:23:56', 3, '', '', 0, 0, '!'),
(5, 'fortest', 'fd9d94340dbd72c11b37ebb0d2a19b4d05e00fd78e4e2ce8923b9ea3a54e900df181cfb112a8a73228d1f3551680e2ad9701a4fcfb248fa7fa77b95180628bb2', 'csl11239753@gmail.com', '', 10, '02C1E7BF89C81C17C49EC125A745769724BF2E65EFC3A99FE17366033C8B6724', 0, 0, '37.229.187.164', '189.84.209.172', '07/05/2020, 03:50', '', '26/09/2020, 12:52:58', '17/10/2020, 11:30:57', 0, '', '', 0, 0, '!'),
(6, 'misteruniverse', 'f64dee65ff44aedd206c8a011c1f418f8ca249d7382b6b81e41b40b9424cccd413c6e05e8620e32840ab8ca81d5439cef33429551ffdfebff547f8b34f0ea1eb', 'daddyslilpeep@gmail.com', '', 4, 'BA8B9F4DCB7C64571F3643535927D55E00B11F3C85198624C54DEDA5CC0AD498', 0, 0, '195.191.32.42', '195.191.32.42', '07/05/2020, 03:51', '', '16/08/2020, 17:07:11', '16/08/2020, 08:01:18', 0, '', '', 0, 0, '!'),
(7, 'freakyzeros', '975465e50716233468dd88ecdabf725eacdb1973e3c778ad8a1652fcc91d3b5fcb55bbe5eb93d7821359dd6d41997cf7d5698ebfb2fc6d1657eb73a5bb3981a3', 'freakyzeros@gmail.com', '', 0, '40365C2F8BD99D59B28E7FA179BE1DF8BDBE3A687276B86F4FB3DEDE11AC21A9', 0, 0, '178.121.69.161', '', '11/05/2020, 23:47', '', '28/05/2020, 00:20:30', '', 0, '', '', 0, 0, '!'),
(8, 'Lichulya', '2a5d96c24da206f305a410077724da0f939d09606df7fde08ada086422c68ef00347597a3462c2b95a73bf423fdfd3cc59c8b8c0e1c8d16c23d5eaf16f7874d8', 'mister21.11@mail.ru', '', 0, 'A48670724E4FC51C24111FA822BB8CDD28675FA12E24043F6F54E59CC2E0E00E', 0, 1, '91.185.78.57', '178.155.68.19', '11/05/2020, 23:48', '', '09/07/2020, 13:23:27', '27/08/2020, 03:57:25', 0, '', '', 0, 0, '!'),
(9, 'Lakkaido', '074f0494c3b948be64bdf0f79b0d9481eb1d05c2b8c3db3323cb1d2968fae1b8f2e2a4d298c2a605647637de54c912f9effc6472cd559c4142af42b217810d5f', 'lakkaido@mail.ru', '', 0, '0418D72B1DE78EE348FD7B26E2F113BF4B6325328AFA8DBFCF53C7794E2B6577', 0, 0, '93.84.182.236', '93.84.182.236', '11/05/2020, 23:52', '', '08/07/2020, 19:15:29', '08/07/2020, 07:22:38', 0, '', '', 0, 0, '!'),
(10, 'feezy', '028adc65025099e7ed089d8beebfe8434688f9d075d9d44bc2ae8fb7db545262eaf9f42cd0f890d93af9984abb1f8939b4a475d75af51ed0f4d607b83c481824', 'tttrashutin@gmail.com', '', 0, '', 0, 0, '80.93.119.220', '178.151.230.103', '11/05/2020, 23:53', '', '13/05/2020, 21:46:39', '27/07/2020, 07:55:10', 0, '', '', 0, 0, '!'),
(11, 'b0drov', '5583497b4c51abd691bef22ce9fbcda7d8e5d142f56fd44cfa08803c76fbdeb2cd6766141a569cf9d9d27b4aff2a903c1ce9757832b30487cddbaf2254977f6c', 'bodrov1784@mail.ru', '', 0, '', 0, 0, '-', '46.39.51.96', '12/05/2020, 00:09', '', '-', '12/05/2020, 07:10:38', 0, '', '', 0, 0, '!'),
(12, 'kn4yz', '074f0494c3b948be64bdf0f79b0d9481eb1d05c2b8c3db3323cb1d2968fae1b8f2e2a4d298c2a605647637de54c912f9effc6472cd559c4142af42b217810d5f', 'serxio149@gmail.com', '', 0, '', 0, 0, '37.45.217.110', '93.84.146.202', '12/05/2020, 02:09', '', '07/07/2020, 00:53:19', '13/05/2020, 06:12:33', 0, '', '', 0, 0, '!'),
(14, 'FROLOV', '0b923b543657267a3cd2966175fe9b8a063fee41af32339e635db34f32f054c647b16efe9fc91358b8652b40ce31b2ebfa48822e34c2e3f8dc92b7787d418648', 'i-russ12@yandex.ru', '', 0, '', 0, 0, '-', '', '12/05/2020, 05:54', '5.136.169.162', '-', '', 0, '', '', 0, 0, '!'),
(15, 'Starman', '83f07661e9a2bcc7dafb2fca9ec0ba56c655eadc57d7dfc2d208653dd2c34d3dcfba4a5147b241e4d11d3af39ad00bb7fe080d343d46269898e080cc65250b17', 'vovacop1@gmail.com', '', 4, '', 0, 0, '188.163.73.149', '77.111.244.26', '12/05/2020, 12:30', '188.163.75.125', '27/07/2020, 17:13:02', '12/05/2020, 01:34:46', 0, '', '', 0, 0, '!'),
(16, 'Imaginary', '9514a6b0eb1d0cd057a55491fa37be50df70c688edde265601727209fa859e4b079ab2dc29c9ce0828cc4d65721a83a15be4f29ff873ad0c61814060c2fd3e60', 'rprrpr23@gmail.com', '', 0, 'EC44F748F346EB147C652F70A2FC13164AFFCF19D704458E9FD96B5DDF9E1914', 0, 0, '176.214.44.106', '94.180.28.251', '12/05/2020, 13:57', '94.180.28.32', '30/05/2020, 16:02:13', '13/05/2020, 08:11:31', 0, '', '', 0, 0, '!'),
(17, 'Braun', '0ca66382b6ad30cb3fb9148ed121c533089e73d4538b4e4f76d32564b42503094144e3606303b3743af8394f8b20d4f241f682a7de96fd47d3cb4eadd6cae3f3', 'dlykiantsiev@gmail.com', '', 0, '', 0, 0, '-', '178.125.34.101', '12/05/2020, 14:47', '178.125.34.101', '-', '12/05/2020, 11:51:13', 0, '', '', 0, 0, '!'),
(20, 'Karnado', '3fbaee1c000eeb88375b6aa81f16fe8d3448690b117c8b3f75aa80cb756d33e872d639f937d10e5e8e111a37a38b7c33882e90c064881b9984d1a10fc679678a', 'afarinka20@gmail.com ', '', 0, '', 0, 0, '-', '178.214.248.57', '12/05/2020, 17:13', '178.214.244.160', '-', '21/05/2020, 09:20:26', 0, '', '', 0, 0, '!'),
(21, 'Lakarlol123', '473b57d8d73ed75f2e7a8ff7c084573da5801a80ad4bf8086ed37442263f0b4ab5ef261aae1d1ff798b3bc1494da2a03f5622d38143f632de475a85b0dbc5634', 'artemk_2019@mail.ru', '', 0, '', 0, 0, '-', '95.59.2.139', '12/05/2020, 17:13', '2.134.209.114', '-', '31/05/2020, 09:44:03', 0, '', '', 0, 0, '!'),
(22, 'Oscar234', 'cb7c5c287b9d519adab551e7bed54e90818fc25651fb2a378e0d890d1aee9ec0232a24b97630a7f9e278a32e5bdf04772f8eafb1cf4c3f851222a4191baef8c8', 'novgorod2019togod@gmail.com', '', 0, '', 0, 0, '-', '94.25.229.22', '12/05/2020, 17:36', '188.162.64.122', '-', '13/05/2020, 06:00:58', 0, '', '', 0, 0, '!'),
(23, 'khabibulinsky', '42bb7c52f3d7156779739bf6b60f11bfb27fb446c94ba82091f5b7fa8ce6a11398dcbe5e90f4083641a3d61d16d4208f504f5ea9e973a3e8591dcd05e6e1642f', 'officerkhabibulin@yandex.ru', '', 0, '710B2F6AD7B31559FD19D323F462AE5B4351537A3D43AB3F3301E12B0E72F5C2', 0, 1, '176.52.99.107', '176.52.99.147', '12/05/2020, 22:22', '176.52.99.113', '15/05/2020, 02:54:19', '11/08/2020, 05:35:29', 0, '', '', 0, 0, '!'),
(24, 'Criminal', 'fd9d94340dbd72c11b37ebb0d2a19b4d05e00fd78e4e2ce8923b9ea3a54e900df181cfb112a8a73228d1f3551680e2ad9701a4fcfb248fa7fa77b95180628bb2', 'csl11391753@gmail.com', '', 0, '', 0, 0, '80.92.29.45', '80.92.29.45', '13/05/2020, 01:53', '80.92.29.36', '21/05/2020, 19:29:24', '21/05/2020, 05:05:12', 0, '', '', 0, 0, '!'),
(25, 'vupsenb', 'e4364280200fcd3573a088e93aae1eb9f4da521712ebe0d5f8e7c495348de99da73fb35846695133ee4016d8543fe2a28aefe9ca90743fdaa85f7e8caf149367', 'ego.sa@mail.ru', '', 0, '', 0, 0, '-', '95.57.43.18', '13/05/2020, 07:41', '95.57.43.18', '-', '13/05/2020, 07:43:25', 0, '', '', 0, 0, '!'),
(26, 'Scheqel', '8c1622a5f7776ff51d9f9438fd9b72e14fc442ad321c9bbc73a4288c8ff09bb5fc1965b3bb784833de5b0190c0b5c6727fc28664b600b8afb8e043210bf7add3', 'loschadka2000@mail.ru', '', 0, '', 0, 0, '-', '178.90.208.69', '13/05/2020, 07:43', '178.90.208.69', '-', '13/05/2020, 07:44:02', 0, '', '', 0, 0, '!'),
(27, 'enzo', '1e09164215efc1004371228cc241410c1496ad275751988cb76c0bae80554a8179a4073102cacc56461d17c1a0a3aab5ab7670a744e293ee96c5f421c4cc2fe2', 'dead1rewazzes@gmail.com', '', 0, '', 0, 0, '-', '178.141.25.135', '13/05/2020, 10:20', '178.141.25.135', '-', '13/05/2020, 10:20:40', 0, '', '', 0, 0, '!'),
(28, 'ThirdBomb', 'c023ea19942f14be2409bd14084b41a5235310c78711fa271ad7c7c00dc7a7c42e53fc4cfe4bc2d5b42f7b7db2a34758de6b6cb41553349320b598230d7de1b8', 'pisbkaotvakikas@yandex.ru', '', 0, '', 0, 0, '-', '79.170.163.229', '13/05/2020, 11:01', '79.170.163.229', '-', '19/05/2020, 01:52:28', 0, '', '', 0, 0, '!'),
(29, 'WooBackBaby', 'c8d73ba0461e3107cadad4eb2927baddb3edc589753f8b180b191c1d9b8f173bc3e4052bc82f4c90316072eda3de94acae222cf3398b0bc1cadeaa2cc183b9cc', 'exelsize7563@gmail.com', '', 0, 'E8856FAE1E5D8FDF8EF66248494635003D56F4C3E10D4C8F9C38A0B6F98FF878', 0, 0, '37.99.112.169', '37.99.112.169', '13/05/2020, 14:40', '37.99.112.169', '13/05/2020, 14:59:49', '13/05/2020, 02:41:17', 0, '', '', 0, 0, '!'),
(30, 'VLGprikhodko', '55b7e1c61ce83a5507f381bc7ee52efcd75d81f54e21bdd2d0fd2b0fe016d45c12c9fde3aeb1e750c1f041f6c43bb575a19292941071d4add6f192a61c40e04a', 'radrigues34@yandex.ru', '', 0, '57B6FFF401810373A5108C2565FCE7F84E8230D9841F1C4B319949B2B7CBB2E2', 0, 0, '85.173.66.83', '85.173.66.83', '13/05/2020, 14:48', '85.173.66.83', '13/05/2020, 19:22:12', '13/05/2020, 05:02:23', 0, '', '', 0, 0, '!'),
(31, 'Aloneshelby', '286a5cd3d36cbd9be86f5197596ab88adc588e06cf3780292b4f4ce21524166842e5d5441d0b83b43362a3f769ab86c521404c4ea56d07dba83e8510c462b1fc', 'Chester822834@mail.ru', '', 0, '', 0, 0, '-', '88.81.35.196', '13/05/2020, 14:50', '88.81.35.196', '-', '13/05/2020, 02:51:06', 0, '', '', 0, 0, '!'),
(32, 'Taylor', '2027fbe5d51e3565a050f022a748d3ddf10ea9b817161f854b0b943c12bbd57ee413e2fe6e3cbc772b925560a3784504977fa8eef4165c86e84bdb70d8b36cc5', 'skullzoom@gmail.com', '', 0, '', 0, 0, '-', '37.212.58.37', '13/05/2020, 15:31', '37.212.92.81', '-', '13/06/2020, 08:23:21', 0, '', '', 0, 0, '!'),
(33, 'lobanov', '70a9777a8831f8c28e3fcf268d2c7f9134b17ff393c130be7451220efafe3a5fe925d27a4988851fd74e63bfa22aea625357798bff34f182aba815b2c0948be8', 'nlobanov066@gmail.com', '', 0, '', 0, 0, '-', '82.208.112.173', '13/05/2020, 18:26', '82.208.112.173', '-', '13/05/2020, 06:26:26', 0, '', '', 0, 0, '!'),
(34, 'steppinup', 'd81db868818a522c86856807dd5f165977e20d99e5346c87f7a23ba9f0bfa89ce630148c4d5e05b3dce9b2ea381a2a0cb189804effdda463d189bcf6838bb514', 'streetenforcer88@gmail.com', '', 0, '', 0, 0, '-', '104.248.173.151', '13/05/2020, 20:17', '104.248.173.151', '-', '13/05/2020, 08:17:20', 0, '', '', 0, 0, '!'),
(35, 'peace111', 'fc52b72d99acb72732a22adcc8a95b8c583a160978d344f7953e8b24c64bfbf10f933bb413dbab1458829278657f225c66957892e617a63a6a4a7b666900b01e', 'castellopurpl3@gmail.com', '', 0, '', 0, 0, '-', '77.111.244.19', '14/05/2020, 12:17', '77.111.247.251', '-', '22/07/2020, 08:20:54', 0, '', '', 0, 0, '!'),
(36, 'quickoGOD', '692b292261d7c290b724b5ae3bb947ececab7501e7f584d0c022474afd60a43a47b8e7681249d98bda91930d7aeb75a5bf3deb50368ae60006d41c8b0ada5ac8', 'everovrockstar@mail.ru', '', 0, '', 0, 0, '-', '188.17.61.245', '14/05/2020, 12:21', '94.50.214.30', '-', '23/05/2020, 06:09:45', 0, '', '', 0, 0, '!'),
(37, 'spaniel', 'f4a870841bbe3c1a9bc3ed1df20bfbcadf380a5435ffb6f4d6ba338c43d10b673c2e9d77d0988f6b0f065bd64c654fd89848f8c38f8e5d0575e469f6094ffdc6', 'lewandoski.cr@mail.ru', '', 0, '163B1AE2CA4B0986D90533C14CC739A382AABD5E9C1ADF78DB00DBFD2F0F2428', 0, 0, '145.255.2.112', '46.191.137.24', '14/05/2020, 13:15', '178.214.253.42', '07/07/2020, 01:57:09', '02/10/2020, 10:14:51', 0, '', '', 0, 0, '!'),
(38, 'Irakli', '8eb8ab46c90781e60b6f5a73c18d293a78c6b6675fab11c9ac4cbfa0cdd5063ee90cd7981777d8524ae71365fb13561e33eaed47aa577816ac9d5a2894d57c34', 'rtveladzesamp@gmail.com', '', 0, '', 0, 0, '-', '62.168.183.214', '14/05/2020, 14:49', '62.168.183.214', '-', '25/05/2020, 08:56:07', 0, '', '', 0, 0, '!'),
(39, 'Vyacheslav', '091ba58562f8e51dcc4e3d826641a03b45ff059aa805ff6c574b75ee66a28fa673b909c87edeefa8f689b717ac4c9b2ade49a209a55e80831431d8663855795a', 'slavik13avdeev@gmail.com', '', 0, '', 0, 0, '-', '88.155.172.137', '14/05/2020, 21:04', '91.239.95.25', '-', '05/06/2020, 09:31:11', 0, '', '', 0, 0, '!'),
(40, 'Melobay', '9482981a65b527af25a80d6566e993b6d7e1f206d7e752298b951ed84ccb49d705b37f29705c2b00c4b9105d5b0bdec5cae90381ab914b9bb6bf1a58a6a3e158', 'melobay2000@gmail.com', '', 0, '', 0, 0, '-', '', '14/05/2020, 21:09', '5.77.154.24', '-', '', 0, '', '', 0, 0, '!'),
(41, 'melobay1', '9482981a65b527af25a80d6566e993b6d7e1f206d7e752298b951ed84ccb49d705b37f29705c2b00c4b9105d5b0bdec5cae90381ab914b9bb6bf1a58a6a3e158', 'melobay2007@mail.ru', '', 0, '', 0, 0, '-', '46.70.151.118', '14/05/2020, 21:12', '5.77.154.24', '-', '15/05/2020, 03:36:02', 0, '', '', 0, 0, '!'),
(42, 'LeoWels', 'e400b6f4cd7f39e452c1388d7105c0a6c75e0fa59d8035a08511ddc677b4217f8d040eed3ecf4640b8449ebf1299066aa4bad40c1457e78025d93a911ff54c78', 'mikjailov@gmail.com', '', 0, '', 0, 0, '217.118.93.168', '31.13.144.12', '14/05/2020, 23:08', '31.13.144.12', '25/05/2020, 00:19:01', '15/05/2020, 11:10:29', 0, '', '', 0, 0, '!'),
(43, 'TAYLON', 'bba269bbff67dc9e83003cb366f3b3a498355c781a04e40d6e79791400c138dc2ee0c7b99512073aa1106c21eead2daaee4cd841d708a880ce721e25821a4fdb', 'danialsshowcompany@gmail.com', '', 0, '', 0, 0, '-', '83.220.238.25', '14/05/2020, 23:52', '83.220.238.25', '-', '14/05/2020, 11:52:20', 0, '', '', 0, 0, '!'),
(44, 'lisedtop', '251c0ea1e02cba50300f6be5d0f9b31bac36e830ce45dd134cc634f1267bc820bc234ad73fde66e65e137099fdaec54962edd15fae57cbf16ae43fa111e2a13e', 'adam_khashumov@mail.ru', '', 0, '', 0, 0, '-', '31.173.27.51', '15/05/2020, 09:01', '31.173.27.51', '-', '15/05/2020, 09:02:39', 0, '', '', 0, 0, '!'),
(45, 'L1nks', 'e9ac70b4a6074223cefb69cb89a743b6bd629b4180a3d6586964fba7aaf2493a9044571ad3a24d1ee56fd85644025428827dc07e48e67e048596b500f23d6d4b', 'mailuv345@gmail.com', '', 0, '', 0, 0, '-', '178.133.1.153', '15/05/2020, 09:40', '128.124.56.162', '-', '15/05/2020, 06:29:35', 0, '', '', 0, 0, '!'),
(46, 'Vladimir', '3a4dbbd016605c2b2b038f510d03d36e775eb598f6fc93522ffbc227f6a9930f8773aaeea7894b1f2d1863596bcc5f23178ceb8eb79a29ffc3b39ca14dee4e10', 'dedov.vova.00@mail.ru', '', 0, '', 0, 0, '-', '213.230.93.11', '15/05/2020, 11:52', '84.54.77.107', '-', '01/06/2020, 08:41:01', 0, '', '', 0, 0, '!'),
(47, 'egoroff', 'fca74079a64ad4611a7340c094816a67cbd10be1c0bc115739caf57379044e40cd36032d2e2448b98ccc28d42c7fc8de005a729aa4f3169a52044f3735700a2b', 'musorskoj87@bk.ru', '', 0, '', 0, 0, '-', '77.108.197.52', '15/05/2020, 11:57', '77.108.197.52', '-', '15/05/2020, 11:57:50', 0, '', '', 0, 0, '!'),
(48, 'Bernd', '0bad40ba31ec77b9f3a79f66a339a2ec5f889bbc644e953155386a217335ec7b38df2036af8a3aa076952bb4636bed690f574714e90303d537d071a4049c0027', 'alisherdyak@yandeks.ru', '', 0, '', 0, 0, '-', '94.140.136.144', '15/05/2020, 14:08', '94.140.136.144', '-', '18/05/2020, 11:33:11', 0, '', '', 0, 0, '!'),
(49, 'RrRp', '3be7efb178947dc4ec594715a55d66ba5c80b05015feb7a22ea0d1cf1fdca8a6d09d92d86b821bc1376e16b3cf27f46ce248c202ec5e10c792ae86f4a51343ec', 'bskolya2@mail.ru', '', 0, '', 0, 0, '-', '176.59.64.229', '15/05/2020, 14:57', '185.144.60.129', '-', '01/08/2020, 11:48:16', 0, '', '', 0, 0, '!'),
(50, 'ekstremist', 'b7ce09457b6cb4f83e398a140aedf2122ba2e1c0869eb31a37594a4518540f40313a2f820c5e6370f81a5d4c7b8c203a089e3de0c293cf398b988f756ff8f0ea', 'stepan52rys@gmail.com', '', 0, '', 0, 0, '-', '5.3.199.215', '15/05/2020, 15:00', '5.3.199.215', '-', '15/05/2020, 03:00:52', 0, '', '', 0, 0, '!'),
(51, 'khandanyann', 'a6d9b1dde928f9937042060713e7f3e90a3ebbe2e7fcf7751ee895aecf9d1dc5b89761279773ac67a4216621b1ecf6b9ed85bfe1461e174ab19b2cd0b7b9b250', 'khandanyann@gmail.com', '', 0, '', 0, 0, '-', '95.32.179.206', '15/05/2020, 16:12', '176.59.74.213', '-', '17/05/2020, 01:03:15', 0, '', '', 0, 0, '!'),
(52, 'Peralta', '81ac12b348acea6b846de8dc42d4d4c9b032b82779f9f79d32bcc2cb7579a2a84a1d9762c5fdc33226ee2591d373f7c61e6cca9854d93f6bbc144886df96afdd', 'ryskinaleksandr@yandex.ru', '', 5, 'A8E5D9DACB64C56BC7812592167A731681C8283FAF712FBC3021E70B23B4E8DE', 0, 0, '37.147.243.187', '37.147.243.187', '15/05/2020, 23:38', '37.147.243.187', '05/08/2020, 19:41:23', '16/05/2020, 09:14:18', 0, '', '', 0, 0, '!'),
(53, 'Ribocho', '3cbf7b7ec88ef5a2b3f7b1059054404ebbf1c94f790c320a1131c3bf4a357f964f244d43514786e85fb7e779b1a76577542c6542709e21926ece2ea4361e468c', 'strowderymusic@gmail.com', '', 0, '', 0, 0, '-', '142.197.151.122', '16/05/2020, 01:41', '142.197.151.122', '-', '16/05/2020, 05:05:20', 0, '', '', 0, 0, '!'),
(54, 'test', 'fd9d94340dbd72c11b37ebb0d2a19b4d05e00fd78e4e2ce8923b9ea3a54e900df181cfb112a8a73228d1f3551680e2ad9701a4fcfb248fa7fa77b95180628bb2', 'testik@mail.ru', '', 0, '', 0, 0, '-', '31.180.179.187', '16/05/2020, 12:55', '85.173.207.15', '-', '23/08/2020, 12:15:06', 0, '', '', 0, 0, '!'),
(55, 'Christopher', '287b1c0f984396cce50ecdf0ca7dfc398c601aaad14446d487568edba1e5211148a974da68a9feb8c1e74eaad810c7b250f7d5db91af17c3e9e0062729a182ae', 'trytotyska@mail.ru', '', 0, '', 0, 0, '-', '92.101.229.58', '16/05/2020, 17:34', '92.101.229.58', '-', '16/05/2020, 05:34:44', 0, '', '', 0, 0, '!'),
(56, 'taurus', 'f798e1b574b690876a28d900ad7dd51c05bc6e69876b8026de20f1e06c99761a1d3f328ca176b503801a0a29e3b3fdec428f71b3505fe10d4098079c915932cf', 'den.parkoov@gmail.com', '', 0, '', 0, 0, '-', '213.103.6.135', '16/05/2020, 20:03', '213.103.6.135', '-', '17/05/2020, 03:31:56', 0, '', '', 0, 0, '!'),
(57, 'Oleg', '724e8bf0d65529731a482a525c3edc6d18168300fc788df6c301bb78cd39fb6a8a199b7628e064a45ac57df05b4078d00f1fc0e929f4dd180313592ef3f482a2', 'doodlic.2uu3@gmail.com', '', 0, '', 0, 0, '-', '94.153.24.135', '16/05/2020, 20:17', '94.153.24.135', '-', '16/05/2020, 08:17:36', 0, '', '', 0, 0, '!'),
(58, 'Bavarot', '6c95402ba8d895462121f0b9a4061e787be73f77fdf0bf0c3a857a95613b34c2cd01b080f0079569292881852c33e16ba66f38397552e91be9952e01d6a72a2b', 'edgeryskall@gmail.com', '', 0, '', 0, 0, '-', '95.179.127.57', '16/05/2020, 21:01', '95.179.19.111', '-', '02/06/2020, 07:20:28', 0, '', '', 0, 0, '!'),
(59, 'MolodoiTrezzini', 'd15e86413d31e1f80b45e70190533be65a8acfdc402467589f76e1dbd1c41a44f3b9fa6390bbeae40dbfe08d9682e01e71efdd99b51f3c430db3aa7395ab2a31', 'francis.ganci228@gmail.com', '', 0, '', 0, 0, '-', '46.172.86.24', '16/05/2020, 21:05', '46.172.87.138', '-', '24/08/2020, 10:16:19', 0, '', '', 0, 0, '!'),
(60, 'khuta28', 'abfe45d71741a6775bf7ff2c1066a9f90eedb2e640152d64f2dc23dcab5ebeb4acbc50de4523137e44d6343b4af03b767a5f608c8139d318a60fac785ccf5db5', 'khutakostya@gmail.com', '', 0, '', 0, 0, '-', '185.30.201.59', '16/05/2020, 21:24', '185.30.201.59', '-', '17/05/2020, 07:49:24', 0, '', '', 0, 0, '!'),
(61, 'Silent', '93da8fd17d1c79be1b433ef8822188e1ea7127a3bcfde2d34544cc0ef574a1451373303fe3d198029ba818598c06eef65ac7b38805dcaa9a71f3eec527a22d43', 'mishenin-vlad9@mail.ru', '', 0, '', 0, 0, '-', '185.126.254.231', '16/05/2020, 21:52', '185.126.254.231', '-', '15/06/2020, 12:41:02', 0, '', '', 0, 0, '!'),
(62, 'otdaycalo16', '58795e9ce6480313541e3ba0ed9b1bb0e4510262aa8d9b347b8cfcb87699f103df5bedc88c03c753e27d31d637a2f8afbc701f585c405b2e67eff87954bc19ac', 'mrartik1722@gmail.com', '', 0, '', 0, 0, '-', '185.30.201.59', '17/05/2020, 12:38', '51.68.154.239', '-', '17/05/2020, 12:39:10', 0, '', '', 0, 0, '!'),
(63, 'Kustik', '64e1b09261f15264e61b670c9e276bd2fa638af3a58f99c5a016c577746ae78c0615ec30adf7d9b1f30ab55c289c35467d70b54bb90d549f553b07cb81b92da8', 'harcevanton22@gmail.com', '', 0, '', 0, 0, '-', '212.26.236.14', '18/05/2020, 13:21', '212.124.6.178', '-', '16/06/2020, 08:33:36', 0, '', '', 0, 0, '!'),
(64, 'crimescene', '50149683b1ce7f73692bdcfe0134f4e02a70d8a5ee9a32af51ea01e1b968cc7d5b22318e443f812b9f4348d60e2ce1c0764e6130431c88b6e9929e6b46971fee', 'cr3ative.stepanoff@yandex.ru', '', 0, 'D03ABAFD0348BF042CD738505DE88ACA35503714536E82A67D79B70EA9EAAC61', 0, 1, '84.53.198.167', '84.53.198.167', '18/05/2020, 16:09', '84.53.198.167', '21/05/2020, 19:45:06', '18/05/2020, 04:09:15', 0, '', '', 0, 0, '!'),
(65, 'Nick', '54871543dbe6e65e0d536a5a81afcb64b002a0cf39692c50059dc33e1d32e4c839bc9c9bc14a22acbb4e8434ebe33be1f956339a2e9432fb880b3c3907063fad', 'nick294business@gmail.com ', '', 0, '', 0, 0, '-', '188.227.220.23', '18/05/2020, 22:10', '213.154.10.194', '-', '02/09/2020, 05:52:04', 0, '', '', 0, 0, '!'),
(66, 'megahealth54', 'a5ca570a8d19b31e8534ee81db555e37c78e3fba86bcff7a61beb150e544b35ef97f73914c18db09e38ce92871c2d450a211d1cb74b3ceaf939f56f6b5653f59', 'lisow.vadig@yandex.ru', '', 0, '', 0, 0, '-', '178.34.161.200', '19/05/2020, 02:34', '178.34.161.200', '-', '19/05/2020, 02:34:37', 0, '', '', 0, 0, '!'),
(67, 'Tayk123132', '1ba04f163759d702a5a5c8fcb9a57c3a2278ab102dcf5fb4ee09672761d5fa0282f455cdaaa86b92644f563e9a91f77071ff80be84336057ebe56212644f03d4', 'denis.makarov.2021@mail.ru', '', 0, '', 0, 0, '-', '109.252.37.174', '19/05/2020, 20:05', '109.252.37.174', '-', '20/05/2020, 03:45:13', 0, '', '', 0, 0, '!'),
(68, 'batyatop', 'e20ec2b4d872ada785c82b10aeb4efaa803e8aecf671642d4521a9bb85e68e7cfc2323b8ccb29a0068d75e9cc59545bdd58990a735a050d56658a1d3d997443e', 'gambit_roleplay85@mail.ru ', '', 0, '', 0, 0, '-', '178.121.28.224', '20/05/2020, 16:42', '178.121.34.173', '-', '13/08/2020, 02:46:35', 0, '', '', 0, 0, '!'),
(69, 'corgi', 'e1ebc50466ec1d28a48a46bc2f06574ae126f321d0aabeb9603134a4bf2f9e93de6d60ab8bc745dd5837b7f48d459f0f222e9cf91030c8b1a38812d2160bfd5b', 'leo.gureckis@gmail.com', '', 0, '', 0, 0, '-', '212.142.125.245', '20/05/2020, 23:41', '212.142.125.245', '-', '22/05/2020, 12:55:13', 0, '', '', 0, 0, '!'),
(70, 'outdakut186', '08414a89c955db7a874de0fa9c550a9f81f079d45e8da15a9506b90b39a3ed096e670b6ab55c63d4dc647c92ef533169a057286f2efee917cee9c2c53272f22a', 'flamie.haunted@yandex.com', '', 0, '', 0, 0, '-', '188.163.64.195', '21/05/2020, 18:02', '188.163.64.195', '-', '21/05/2020, 06:07:55', 0, '', '', 0, 0, '!'),
(71, 'SirDeForte', 'd1eb85433ad904ad5ed4742fd6c7022444afc7a80b58b9e0dfd74ea10da37af6247b0b0053f67ba68d5535484a99f44332398f410f2ed74d9343db5198e840ff', 'aeroflotvasy@gmail.com', '', 0, '', 0, 0, '-', '', '23/05/2020, 16:19', '83.102.217.74', '-', '', 0, '', '', 0, 0, '!'),
(72, 'Sakuta', '77ce752d1fee9c5dda868b9375a0ac67d2de18d9f3c536664927c05cc39baeec3aa9fa448079c8da57a9892a6c0c54c9c4425ba5d4cd996ef92136b421472584', '17sanya170@mail.ru', '', 0, '', 0, 0, '-', '89.113.143.79', '25/05/2020, 15:09', '89.113.142.7', '-', '01/06/2020, 07:54:10', 0, '', '', 0, 0, '!'),
(73, 'zaharoff', 'e78fe1aed2561c2b3b1240966cdc8819bb9daee5fe5d439025e02e9b8f6e88a786e6f902bdde1c221af72e8215ca62b809b48117a1a05b95e21d0d11cd6b2249', 'ilya.zaharov01@gmail.com', '', 0, '', 0, 0, '-', '128.72.119.171', '25/05/2020, 21:53', '128.72.119.171', '-', '27/05/2020, 12:26:24', 0, '', '', 0, 0, '!'),
(74, 'Comandante', 'd813e98f3bd3d038dff147958b5ee1a902cac1571446dce1749177b69543d9506429e3cd33cd70f76ab3646ff02c2687f0e37cd6e136f0c5e9049a5a3f41faf2', 'stalin.rastrelyat@yandex.ru', '', 0, '', 0, 0, '-', '31.133.65.153', '26/05/2020, 10:33', '31.133.65.90', '-', '06/06/2020, 10:25:49', 0, '', '', 0, 0, '!'),
(75, 'kiton', '623375d2b8cb84768bc2190af91480e2d69f528bb27195e16063937293eb13e6041bcbcb35c2bf8f626be5b523620eb88a806f4bbb5b8d29d53f85164ba3d714', 'ansarchikee01@gmail.com', '', 0, '', 0, 0, '-', '188.0.175.7', '26/05/2020, 15:54', '188.0.169.165', '-', '31/05/2020, 04:50:20', 0, '', '', 0, 0, '!'),
(76, 'chelovek113', '6414080bba434dfe4e18947edc104fed568db5fd522a6a95ef25c7aa79ce7c0a5b2f3d9efe854b5217c0395ba8b634aee88f3d5e5c5b24416f19e753a89a9118', 'vladmaliona@gmail.com', '', 0, '', 0, 0, '-', '176.112.132.69', '27/05/2020, 14:31', '176.112.132.69', '-', '27/05/2020, 02:31:28', 0, '', '', 0, 0, '!'),
(77, 'Smoortik', '52178e235b56d025eb3d5b6cba48c7254401599935846f56382900f7015d9513ce0c2f840bae1d2bc1e7c263b05ffb94cc69b492f901e94fb2b1b421e1b941fe', 'ashole123@gmail.com', '', 0, '', 0, 0, '-', '', '07/06/2020, 19:01', '5.43.240.222', '-', '', 0, '', '', 0, 0, '!'),
(78, 'golovA', '4e3811147ed12ec784f56fec80105127efaff44c092d8cef0b82950a20201ec86a0b78f18ed1c30983e34acf5e995051365e74ac81d34f13149626675aa5666d', 'golovin.org@gmail.com', '', 0, '', 0, 0, '5.44.174.96', '5.44.174.96', '07/06/2020, 19:05', '5.44.174.96', '09/06/2020, 08:53:13', '09/06/2020, 08:49:45', 0, '', '', 0, 0, '!'),
(79, 'Alex182', '848752584a11b59da3d8d1dbd5babbcf1adc0b775d3ffff7437da9d1b97d1acd081395b85951c72d9866ec89003f8fe1ff27892ff29f952e39090fb59e378544', 'frozsan@mail.ru', '', 0, '', 0, 0, '-', '77.111.244.31', '08/06/2020, 13:21', '77.111.244.31', '-', '08/06/2020, 01:21:38', 0, '', '', 0, 0, '!'),
(80, 'EscapeFromGetto', 'dfbc8b767297a0b939574155b93a8c857de7d2ed7b903431690cec9f3c987572dd642485eb73bd7d7db94bdeaa82733c98409f9dd4ca2ed059e8d2d756db4be3', 'gamesfederal236@gmail.com', '', 0, '', 0, 0, '-', '77.111.247.196', '13/06/2020, 17:07', '77.111.244.210', '-', '23/06/2020, 06:43:37', 0, '', '', 0, 0, '!'),
(81, 'diana55', '6e59bf5b687e0ef5a4a5c634ce4cb43f945a5cd2dc104678e7163c46abcac4873031525870300f3b2adec7f1c91047082ae16e75de3b2d590ea969d8e31906af', 'mishenin-vlad12@mail.ru', '', 0, '', 0, 0, '-', '176.197.63.38', '15/06/2020, 15:16', '176.197.63.38', '-', '15/06/2020, 03:55:43', 0, '', '', 0, 0, '!'),
(82, 'glebsh00ter', '30a303649f8b68ac2058506d63cbd49f6cc804de4e2e2709e1d50793d54cf13116e681e8f0764b0daee52184bd31a8fd2dc670c17b00458be7ef0f49d69423da', 'scripterdelitant1337@gmail.com', '', 4, '691AA3AFE0307F7BE27DFF43FA6F216587CC5272412C7C8E2539F5FF05962F41', 0, 1, '79.172.76.130', '79.172.112.187', '06/07/2020, 18:55', '79.172.101.249', '16/08/2020, 16:27:57', '12/10/2020, 09:24:29', 0, '', '', 0, 0, '!'),
(83, 'samperas', 'aa2c85cf5dac23f1b31d2475eb0f45440b2173e10c14a7fcc947aa1a58a7c22d9000a70e07c34998661734899ac784df20c6ea5de55c076ddf5748ebab25b409', 'thevalenok5@gmail.com', '', 4, 'EF3089FC68E999F9E2FE79877387739C9F0A2A00D852FFD2AA5626ADB2233319', 0, 0, '46.158.217.224', '31.181.143.125', '20/07/2020, 18:07', '31.181.143.125', '11/09/2020, 15:20:32', '20/07/2020, 06:08:09', 0, '', '', 0, 0, '!'),
(84, 'seazzz', '3f4811b9e6c37ce5900ada5bc660c8632d13ea28a11dd0c54e3e0fd4c776f285ab1678c7fa708ff0078fb495bc05c09d654b063f07eb1859f3440e4b5f1b5449', 'shalotskiy@mail.ru', '', 0, '', 0, 0, '-', '37.212.78.108', '18/08/2020, 20:49', '37.212.78.108', '-', '18/08/2020, 08:49:21', 0, '', '', 0, 0, '!'),
(85, 'Jay', 'b1ebfdcd686a81a1b9ba23b7f32d450e37ed8a298a92ffd9ac51bd89adbd0eb6c34ea27ee0e93d3d623afd61fbdb08cb06fbae26857394cd029104394f2ada9f', 'a.bryzgalov2002@gmail.com', '', 0, '', 0, 0, '-', '91.204.150.169', '31/08/2020, 13:30', '91.204.150.169', '-', '31/08/2020, 08:12:31', 0, '', '', 0, 0, '!'),
(86, 'pevnevetsd', '16dfc7cb1101018a4d8059b57880ea7961cd97ac7fee967328ba7d06d487d0ac64723b69472459718baabe314c755a2e3eed7a8a289502f13f8d71057b82893e', 'pevnevec.2003@mail.ru', '', 0, '', 0, 0, '-', '37.212.81.24', '02/09/2020, 16:07', '37.212.57.128', '-', '19/09/2020, 07:46:07', 0, '', '', 0, 0, '!');

-- --------------------------------------------------------

--
-- Структура таблицы `anticheat_settings`
--

CREATE TABLE IF NOT EXISTS `anticheat_settings` (
  `ac_code` int(2) NOT NULL,
  `ac_code_trigger_type` int(1) NOT NULL,
  UNIQUE KEY `ac_code` (`ac_code`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `anticheat_settings`
--

INSERT INTO `anticheat_settings` (`ac_code`, `ac_code_trigger_type`) VALUES
(0, 0),
(1, 0),
(2, 0),
(3, 0),
(4, 0),
(5, 0),
(6, 0),
(7, 0),
(8, 0),
(9, 0),
(10, 0),
(11, 0),
(12, 0),
(13, 0),
(14, 0),
(15, 0),
(16, 0),
(17, 0),
(18, 0),
(19, 0),
(20, 0),
(21, 0),
(22, 0),
(23, 0),
(24, 0),
(25, 0),
(26, 0),
(27, 0),
(28, 0),
(29, 0),
(30, 0),
(31, 0),
(32, 0),
(33, 0),
(34, 0),
(35, 0),
(36, 0),
(37, 0),
(38, 0),
(39, 0),
(40, 0),
(41, 0),
(42, 0),
(43, 0),
(44, 0),
(45, 0),
(46, 0),
(47, 0),
(48, 0),
(49, 0),
(50, 0),
(51, 0),
(52, 0);

-- --------------------------------------------------------

--
-- Структура таблицы `apartment`
--

CREATE TABLE IF NOT EXISTS `apartment` (
  `id` int(10) NOT NULL AUTO_INCREMENT,
  `posx` float NOT NULL,
  `posy` float NOT NULL,
  `posz` float NOT NULL,
  `exitx` float NOT NULL,
  `exity` float NOT NULL,
  `exitz` float NOT NULL,
  `exitint` int(11) NOT NULL,
  `exitvw` int(11) NOT NULL,
  `posint` int(11) NOT NULL,
  `posvw` int(11) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB  DEFAULT CHARSET=utf8 AUTO_INCREMENT=4 ;

--
-- Дамп данных таблицы `apartment`
--

INSERT INTO `apartment` (`id`, `posx`, `posy`, `posz`, `exitx`, `exity`, `exitz`, `exitint`, `exitvw`, `posint`, `posvw`) VALUES
(1, 162.294, -169.803, 1.58472, 1767.83, -1541.93, 1187.38, 14, 1000, 0, 0),
(2, 1374.15, 405.022, 19.9555, 1301.71, -1467.88, 3001.09, 16, 1001, 0, 0),
(3, 1341.19, 396.144, 19.5547, 619, -1397, 1000, 1, 1002, 0, 0);

-- --------------------------------------------------------

--
-- Структура таблицы `apbs`
--

CREATE TABLE IF NOT EXISTS `apbs` (
  `id` int(10) NOT NULL AUTO_INCREMENT,
  `charge` varchar(128) NOT NULL,
  `suspect` varchar(24) NOT NULL,
  `officer` varchar(24) NOT NULL,
  `date` varchar(32) NOT NULL,
  `faction` tinyint(1) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 AUTO_INCREMENT=1 ;

-- --------------------------------------------------------

--
-- Структура таблицы `ateles`
--

CREATE TABLE IF NOT EXISTS `ateles` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `mapname` varchar(32) NOT NULL,
  `posx` float NOT NULL,
  `posy` float NOT NULL,
  `posz` float NOT NULL,
  `interior` int(10) NOT NULL,
  `type` tinyint(1) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB  DEFAULT CHARSET=utf8 AUTO_INCREMENT=294 ;

--
-- Дамп данных таблицы `ateles`
--

INSERT INTO `ateles` (`id`, `mapname`, `posx`, `posy`, `posz`, `interior`, `type`) VALUES
(1, 'Трейлер-дом', 2335.29, -1047.32, 44.7, 54, 0),
(3, 'Бар-байкеров', 2081.13, 2345.47, -89.1952, 55, 4),
(4, 'Стильный бар', 1551.07, 2241.82, 1117.88, 53, 4),
(5, 'Library', -8853.29, 2285.3, 98.8151, 17, 3),
(6, 'Sheriff Office', 694.537, 1623.85, 785.549, 16, 3),
(50, '2 Комнаты', -79.946, 1383.22, 1078.95, 10, 1),
(51, '2 Комнаты', -48.146, 1458.48, 1085.61, 10, 1),
(52, '3 Комнаты', 46.074, 1439.4, 1082.42, 10, 1),
(53, '3 Комнаты', 289.844, 1501.63, 1078.42, 10, 1),
(54, '3 Комнаты', 329.309, 1512.79, 1085.81, 10, 1),
(55, '2 Комнаты', 390.631, 1505.86, 1080.1, 10, 1),
(56, '3 Комнаты', 375.906, 1378.56, 1079.8, 10, 1),
(57, '3 Комнаты', 448.283, 1353.72, 1082.22, 10, 1),
(58, '2 Комнаты', 295.076, 1284.97, 1078.45, 10, 1),
(59, '2 Комнаты', 191.179, 1288.8, 1082.14, 10, 1),
(60, '2 Комнаты', 290.743, 1242.41, 1082.68, 10, 1),
(61, 'Комнаты', 244.184, 1145.49, 1081.17, 10, 1),
(62, '3 Комнаты (Наркопритон)', 326.154, 1074.7, 1082.25, 10, 1),
(63, '3 Комнаты', 2370.56, -1094.54, 1049.63, 10, 1),
(65, '2 Комнаты', 2260.73, -1121.14, 1048.89, 10, 0),
(66, '1 Комната с туалетом', 2284.81, -1126.49, 1050.92, 10, 0),
(67, '1 Комната с чуланом', 2313.37, -1230.69, 1047.41, 10, 0),
(68, '2 Комнаты', 2244.01, -1028.16, 1047.77, 10, 1),
(69, '3 Комнаты', 2273.05, -1242.67, 1048.6, 10, 1),
(70, '4 Комнаты', 2149.88, -1216.49, 1049.12, 10, 1),
(71, '2 Комнаты (деревянный)', 2364.21, -1075.01, 1047.77, 10, 0),
(72, 'Маленькая комната', 242.261, 323.128, 999.591, 10, 0),
(73, 'Маленькая комната (2)', 265.524, 321.573, 997.143, 10, 0),
(74, 'Адская комната', 360.428, 304.129, 996.897, 10, 0),
(75, 'Комната из мотеля', 2189.71, -1073.5, 1050.48, 10, 0),
(76, 'Комната из мотеля (2)', 2254.8, -1112.91, 1049.13, 10, 0),
(77, '2 Комнаты', 2298.23, -1093.8, 1048.87, 10, 0),
(79, '2-х этажный (2 комнаты)', 7.756, 1305.29, 1082.83, 10, 2),
(80, '2-х этажный (4 комнаты)', 82.945, 1271.77, 1079.89, 10, 2),
(81, '2-х этажный (4 комнаты)', 156.189, 1409.53, 1086.43, 10, 2),
(82, '2-х этажный (4 комнаты)', 509.63, 1353.89, 1076.78, 10, 2),
(83, '3 комнаты & стрипзиз', 745.101, 1412.19, 1102.43, 10, 2),
(84, '5 комнат и 2 ванны (дорогой)', 199.069, 1110.66, 1083.21, 10, 2),
(85, '5 комнат и 2 ванны (дорогой)', 278.118, 1057.52, 1083.45, 10, 2),
(86, '5 комнат и 2 ванны (дорогой)', 263.242, 978.003, 1083.69, 10, 2),
(87, 'Большой дом - особняк', 2373.63, -1184.07, 1053.21, 10, 2),
(92, 'Marcos Bistro', -794.846, 489.288, 1376.19, 1, 4),
(93, 'Big Spread Ranch (Bar)', 1212.15, -25.875, 1000.95, 3, 4),
(94, 'Burger Shot', 362.884, -75.18, 1001.51, 10, 4),
(95, 'Cluckin Bell', 364.917, -11.756, 1001.85, 9, 4),
(96, 'Well Stacked Pizza', 372.319, -133.524, 1001.49, 5, 4),
(97, 'Rusty Brown Donuts', 377.068, -193.304, 1000.63, 17, 4),
(98, 'Jays Diner', 460.557, -88.582, 999.555, 4, 4),
(99, 'Pump Truck Stop Diner', 681.618, -451.589, -25.617, 1, 4),
(100, 'Alhambra', 493.502, -24.335, 1000.68, 17, 4),
(101, 'Mistys', 501.95, -67.588, 998.758, 11, 4),
(102, 'Lil Probe Inn', -229.295, 1401.16, 27.766, 18, 4),
(103, 'Exclusive (Clothes)', 204.32, -168.86, 1000.52, 14, 4),
(104, 'Binco (Clothes)', 207.646, -111.267, 1005.13, 15, 4),
(105, 'ProLaps (Clothes)', 207.041, -140.372, 1003.51, 3, 4),
(106, 'SubUrban (Clothes)', 203.696, -50.665, 1001.8, 1, 4),
(107, 'Victim (Clothes)', 227.563, -8.103, 1002.21, 5, 4),
(108, 'ZIP (Clothes)', 161.384, -96.974, 1001.8, 18, 4),
(109, 'Small Casino in RW', 1133.12, -15.832, 1000.68, 12, 4),
(110, 'Off Track Betting', 834.668, 7.423, 1004.19, 3, 4),
(111, 'Sex Shop', -100.327, -25.038, 1000.72, 3, 4),
(112, 'Zero Shop', -2240.96, 128.368, 1035.41, 6, 4),
(113, 'Ammo 1', 285.459, -41.805, 1001.52, 1, 4),
(114, 'Ammo 2', 285.848, -86.782, 1001.52, 4, 4),
(115, 'Ammo 3', 296.864, -112.069, 1001.52, 6, 4),
(116, 'Ammo 4', 316.33, -170.297, 999.594, 6, 4),
(117, 'Jizzy Club', -2636.61, 1402.46, 906.461, 3, 4),
(118, '24/7 (1)', -25.919, -188.256, 1003.55, 17, 4),
(119, '24/7 (2)', 6.026, -31.767, 1003.55, 10, 4),
(120, '24/7 (3)', -31.019, -92.006, 1003.55, 18, 4),
(121, '24/7 (4)', -25.909, -141.559, 1003.55, 16, 4),
(122, '24/7 (5)', -27.361, -58.2, 1003.55, 6, 4),
(123, 'Advert / Phone Network', 1494.42, 1303.58, 1093.29, 3, 4),
(124, 'Bothel', 964.457, -53.208, 1001.12, 3, 4),
(125, '4 Dragon Casino', 2019.07, 1017.79, 996.875, 10, 4),
(126, '4 Bikers Garage', 627.304, -11.979, 1000.92, 1, 4),
(127, 'Ganton Gym', 772.307, -5.516, 1000.73, 5, 4),
(129, 'Tattoo 2', -204.352, -44.393, 1002.27, 3, 4),
(130, 'Crack Den', 318.64, 1114.48, 1083.88, 5, 4),
(131, 'Meat Factory', 965.381, 2107.92, 1011.03, 1, 4),
(132, 'Barber Shop', 418.637, -84.365, 1001.8, 3, 4),
(133, 'Bank Palomino', 2304.69, -16.152, 26.742, 0, 4),
(135, 'SA Bank', 149.549, 124.936, 999.059, 8, 4),
(137, 'SPA Salon', 2437.67, -1365.56, 1001.09, 11, 4),
(143, 'Bar Liberty (2)', 2479.82, -1799.69, 2743.39, 12, 4),
(149, 'PubLex', 447.056, -92.381, 1023.98, 16, 4),
(150, 'Pub Pool', -84.655, -56.359, 953.262, 17, 4),
(154, 'Bar', 2404.14, -1498.1, 2796.1, 1, 4),
(155, 'Meat Shop', -2267.08, -24.264, 1624.24, 1, 4),
(163, 'Blue Cafe', 2398.67, 2481.57, 74.594, 1, 4),
(164, 'Bordel', 358.471, 2964.16, 8.712, 1, 4),
(167, 'Bar GTA3', 2272.26, -1480.55, 1799.09, 1, 4),
(168, 'Wayshop', 1534.79, -1360.26, 1613.8, 1, 4),
(169, 'Undeground Podval ', 2490.49, -1663.32, 2022.18, 1, 4),
(174, 'Strip club bezquit', 613.974, -31.26, 1268.99, 2, 4),
(175, 'Склад2', 619.069, 41.832, 1007.35, 1, 4),
(180, 'Polish Tavern', 1363.1, -3.429, 1000.97, 16, 4),
(181, 'Pub Gunner', 1165.65, -1012.07, 1083.16, 17, 4),
(182, 'Bar Gunner', 551.235, -65.47, 1001.53, 15, 4),
(184, 'Pawnshop', -1703.09, -686.818, 1001.09, 9, 4),
(186, 'Pawnshop(2)', 961.435, 34.749, 1002.45, 13, 4),
(189, 'Офис', -2124.3, 3279.94, 95.665, 18, 4),
(191, 'Прачечная(2)', 313.309, -83.665, 1097.29, 22, 4),
(193, 'Корейский кафе', 361.598, 2236.48, 3701.09, 1, 4),
(270, 'Night Club by Milker', 953.653, -1390.37, 899.262, 24, 4),
(271, 'Massage Salon ', 504.855, -1633.42, 3001.21, 5, 4),
(272, 'Pawnshop.Podval', 2509.06, -1756.68, 1446.21, 31, 4),
(273, 'Hotel Gunner', -79.467, 1232.93, 1501.66, 25, 4),
(278, 'Red Bed Motel Room', 235.509, 1189.17, 1080.34, 3, 0),
(280, 'Sheriff''s cells', 1568.27, -1672.59, 2982.28, 16, 3),
(282, 'HOSPITAL 1', 1184.04, -1323.18, 13.575, 0, 3),
(283, 'HOSPITAL 2', 2034.52, -1414.69, 16.992, 0, 3),
(286, 'Fire Dept Int by Artemii', 2525.14, 117.628, 384.357, 15, 3),
(287, 'office [by arcenii]', -2606.44, 622.795, 1230.21, 10, 4),
(289, 'small 24/7 [by arcenii]', 598.351, 2286.61, 730.907, 10, 4),
(290, 'prachka [by arcenii]', 1332.13, 586.117, 470.216, 10, 4),
(293, 'Pharmacy', 1718.4, 175.891, 621.133, 20, 4);

-- --------------------------------------------------------

--
-- Структура таблицы `atms`
--

CREATE TABLE IF NOT EXISTS `atms` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `posx` float NOT NULL,
  `posy` float NOT NULL,
  `posz` float NOT NULL,
  `posrz` float NOT NULL,
  `interior` int(11) NOT NULL,
  `vw` int(11) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB  DEFAULT CHARSET=utf8 AUTO_INCREMENT=5 ;

--
-- Дамп данных таблицы `atms`
--

INSERT INTO `atms` (`id`, `posx`, `posy`, `posz`, `posrz`, `interior`, `vw`) VALUES
(1, 252.721, -62.246, 1.178, -1.439, 0, 0),
(2, 207.638, -231.445, 1.171, 179.814, 0, 0),
(3, 661.377, -567.308, 15.936, -88.475, 0, 0),
(4, 242.423, -172.162, 1.188, 272.915, 0, 0);

-- --------------------------------------------------------

--
-- Структура таблицы `bans`
--

CREATE TABLE IF NOT EXISTS `bans` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `name` varchar(24) NOT NULL DEFAULT '-',
  `accountid` int(11) NOT NULL,
  `reason` varchar(128) NOT NULL,
  `ip` varchar(24) NOT NULL DEFAULT '-',
  `date` varchar(21) NOT NULL,
  `admin` varchar(24) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 AUTO_INCREMENT=1 ;

-- --------------------------------------------------------

--
-- Структура таблицы `billboards`
--

CREATE TABLE IF NOT EXISTS `billboards` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `text` varchar(100) NOT NULL,
  `rentby` int(11) NOT NULL,
  `cost` int(11) NOT NULL,
  `rentdate` int(11) NOT NULL,
  `posX` float NOT NULL,
  `posY` float NOT NULL,
  `posZ` float NOT NULL,
  `posRX` float NOT NULL,
  `posRY` float NOT NULL,
  `posRZ` float NOT NULL,
  `int` int(11) NOT NULL,
  `vw` int(11) NOT NULL,
  `model` int(11) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB  DEFAULT CHARSET=utf8 AUTO_INCREMENT=4 ;

--
-- Дамп данных таблицы `billboards`
--

INSERT INTO `billboards` (`id`, `text`, `rentby`, `cost`, `rentdate`, `posX`, `posY`, `posZ`, `posRX`, `posRY`, `posRZ`, `int`, `vw`, `model`) VALUES
(2, 'КУПИ РЕКЛАМУ\nРЕКЛАМНЫЙ ЩИТ #1\n{595959}Тел. 1-800-555', 0, 1500, 0, 256.491, -156.44, 5.82, 0, 0, -0.3, 0, 0, 9314),
(3, 'КУПИ РЕКЛАМУ\nРЕКЛАМНЫЙ ЩИТ #1\n{595959}Тел. 1-800-555', 0, 3500, 0, 2434.17, 112.571, 32.478, 0, 0, 179.6, 0, 0, 9314);

-- --------------------------------------------------------

--
-- Структура таблицы `business`
--

CREATE TABLE IF NOT EXISTS `business` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `posx` float NOT NULL,
  `posy` float NOT NULL,
  `posz` float NOT NULL,
  `exitx` float NOT NULL,
  `exity` float NOT NULL,
  `exitz` float NOT NULL,
  `name` varchar(32) NOT NULL,
  `entermsg` varchar(128) NOT NULL,
  `owner` int(11) NOT NULL,
  `locked` tinyint(1) NOT NULL DEFAULT '1',
  `price` int(10) NOT NULL,
  `freeze` int(2) NOT NULL,
  `levelbuy` int(4) NOT NULL,
  `exitint` int(11) NOT NULL,
  `exitvw` int(11) NOT NULL,
  `cash` int(10) NOT NULL,
  `type` int(4) NOT NULL,
  `entrance` int(11) NOT NULL,
  `radio` int(2) NOT NULL,
  `ddoor` int(2) NOT NULL,
  `productprice0` int(4) NOT NULL,
  `productprice1` int(4) NOT NULL,
  `productprice2` int(4) NOT NULL,
  `productprice3` int(4) NOT NULL,
  `productprice4` int(4) NOT NULL,
  `productprice5` int(4) NOT NULL,
  `productprice6` int(4) NOT NULL,
  `productprice7` int(4) NOT NULL,
  `productprice8` int(4) NOT NULL,
  `productprice9` int(4) NOT NULL,
  `productprice10` int(4) NOT NULL,
  `productprice11` int(4) NOT NULL,
  `posint` int(11) NOT NULL,
  `posvw` int(11) NOT NULL,
  `product` int(11) NOT NULL,
  `buy_price` int(11) NOT NULL,
  `buy_amount` int(11) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB  DEFAULT CHARSET=utf8 AUTO_INCREMENT=48 ;

--
-- Дамп данных таблицы `business`
--

INSERT INTO `business` (`id`, `posx`, `posy`, `posz`, `exitx`, `exity`, `exitz`, `name`, `entermsg`, `owner`, `locked`, `price`, `freeze`, `levelbuy`, `exitint`, `exitvw`, `cash`, `type`, `entrance`, `radio`, `ddoor`, `productprice0`, `productprice1`, `productprice2`, `productprice3`, `productprice4`, `productprice5`, `productprice6`, `productprice7`, `productprice8`, `productprice9`, `productprice10`, `productprice11`, `posint`, `posvw`, `product`, `buy_price`, `buy_amount`) VALUES
(1, 613.486, -518.466, 16.353, 1490.76, 1305.71, 1093.3, 'Автосалон', '', 0, 1, 100000, 1, 1, 3, 5000, 0, 9, 0, 0, 0, 100, 100, 200, 300, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(2, 2267.21, 31.222, 26.614, 2267.21, 31.222, 26.614, 'Заправка', '', 0, 0, 10000, 0, 1, 0, 5001, 0, 6, 15, 0, 0, 100, 100, 200, 300, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 10, 100, 0),
(3, 655.668, -564.841, 16.336, 655.668, -564.841, 16.336, 'Заправка', '', 0, 0, 10000, 1, 1, 0, 0, 0, 6, 10, 0, 0, 100, 100, 200, 300, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 10, 0, 0),
(5, 348.711, -124.29, 1.627, 348.711, -124.29, 1.627, 'Автомастерская', '', 0, 0, 15000, 0, 1, 0, 5004, 0, 7, 0, 0, 0, 100, 100, 200, 300, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 400, 0, 0),
(6, 203.386, -202.191, 1.578, 372.319, -133.524, 1001.49, 'Well Stacked Pizza', '', 0, 0, 10000, 0, 1, 5, 5005, 0, 15, 0, 0, 0, 100, 100, 200, 300, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 400, 0, 0),
(7, 208.276, -226.109, 1.742, -229.295, 1401.16, 27.766, 'Заправка', '', 0, 0, 10000, 1, 1, 18, 5003, 0, 6, 10, 0, 0, 100, 100, 200, 300, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 10, 0, 0),
(8, 172.128, -152.627, 1.575, -27.361, -58.2, 1003.55, 'Магазин 24/7', '', 0, 0, 10000, 0, 1, 6, 5006, 0, 2, 0, 0, 0, 300, 500, 1500, 50, 100, 100, 1000, 50, 100, 1500, 3000, 150, 0, 0, 400, 0, 0),
(9, 243.295, -178.298, 1.582, 285.459, -41.805, 1001.52, 'Аммуниция', '', 0, 0, 15000, 0, 1, 1, 5007, 0, 3, 0, 0, 0, 100, 100, 200, 300, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 400, 0, 0),
(10, 255.458, -191.953, 1.578, -1703.09, -686.818, 1001.09, 'Ломбард', '', 0, 0, 10000, 0, 1, 9, 5008, 0, 22, 0, 0, 0, 100, 100, 200, 300, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 150, 50, 0),
(11, 273.17, -195.58, 1.57, 1332.13, 586.117, 470.216, 'Прачечная', '', 0, 0, 10000, 0, 1, 10, 5009, 0, 0, 0, 0, 0, 100, 100, 200, 300, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 400, 0, 0),
(12, 273.195, -158.147, 1.741, 551.235, -65.47, 1001.53, 'Бар/Клуб', '', 0, 0, 10000, 0, 1, 15, 5010, 0, 1, 0, 0, 0, 100, 200, 100, 50, 300, 500, 100, 300, 0, 0, 0, 0, 0, 0, 150, 50, 0),
(13, 1381.82, 459.147, 20.345, 1381.82, 459.147, 20.345, 'Заправка', '', 0, 0, 10000, 1, 1, 0, 5011, 0, 6, 10, 0, 0, 100, 100, 200, 300, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 10, 0, 0),
(16, 293.342, -195.37, 1.779, 1551.07, 2241.82, 1117.88, 'Ресторан', 'Хало', 0, 0, 15000, 0, 1, 53, 5013, 0, 19, 0, 0, 0, 100, 100, 200, 300, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 150, 50, 0),
(17, 209.612, -231.448, 1.571, 598.351, 2286.61, 730.907, 'Магазин 24/7', '', 0, 0, 15000, 0, 1, 10, 5014, 0, 2, 0, 0, 0, 300, 500, 1500, 50, 100, 100, 1000, 50, 100, 1500, 3000, 150, 0, 0, 400, 0, 0),
(18, 218.872, -231.448, 1.571, 1718.4, 175.891, 621.133, 'Аптека', '', 0, 0, 15000, 0, 1, 20, 5015, 0, 21, 0, 0, 0, 1000, 1500, 1000, 1000, 1500, 1000, 1500, 1000, 1000, 1000, 2000, 1500, 0, 0, 400, 0, 0),
(20, 257.082, 6.91, 2.443, 257.082, 6.91, 2.443, 'Тюнинг-ателье', '', 0, 0, 25000, 0, 1, 0, 5012, 0, 12, 0, 0, 0, 100, 100, 200, 300, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 400, 0, 0),
(21, 1383.24, 465.565, 20.192, 1383.24, 465.565, 20.192, 'Магазин 24/7', '', 0, 0, 15000, 0, 1, 0, 5016, 0, 2, 0, 0, 0, 300, 500, 1500, 50, 100, 100, 1000, 50, 100, 1500, 3000, 150, 0, 0, 400, 0, 0),
(22, 1374.91, 469.271, 20.181, 1718.4, 175.891, 621.133, 'Аптека', '', 0, 0, 15000, 0, 1, 20, 5017, 0, 21, 0, 0, 0, 1000, 1500, 1000, 1000, 1500, 1000, 1500, 1000, 1000, 1000, 2000, 1500, 0, 0, 400, 0, 0),
(23, 260.108, -151.48, 1.57, -2606.44, 622.795, 1230.21, 'Строительная компания', '', 0, 0, 25000, 1, 1, 10, 5018, 0, 20, 0, 0, 0, 100, 100, 200, 300, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 400, 0, 0),
(25, 143.724, -200.808, 1.578, 1165.65, -1012.07, 1083.16, 'Бар/Клуб', '', 0, 0, 15000, 0, 1, 17, 5020, 0, 1, 0, 0, 0, 100, 200, 100, 50, 300, 500, 100, 300, 0, 0, 0, 0, 0, 0, 400, 0, 0),
(26, 171.851, -200.858, 1.57, 207.041, -140.372, 1003.51, 'Магазин одежды', '', 0, 0, 15000, 0, 1, 3, 5021, 0, 4, 0, 0, 0, 100, 100, 200, 300, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 400, 0, 0),
(27, 142.458, -181.01, 1.578, 418.637, -84.365, 1001.8, 'Барбер шоп', '', 0, 0, 15000, 0, 1, 3, 5019, 0, 5, 0, 0, 0, 100, 100, 200, 300, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 400, 0, 0),
(28, 2303.83, -16.139, 26.484, 149.549, 124.936, 999.059, 'Банк', '', 0, 0, 45000, 1, 1, 8, 5022, 0, 8, 0, 0, 0, 100, 100, 200, 300, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 400, 0, 0),
(29, 1367.54, 248.262, 19.567, 372.319, -133.524, 1001.49, 'Well Stacked Pizza', '', 0, 0, 15000, 0, 1, 5, 5023, 0, 15, 0, 0, 0, 100, 100, 200, 300, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 400, 0, 0),
(30, 660.898, -573.391, 16.336, 663.455, -573.353, 16.336, 'Магазин 24/7', '', 0, 0, 15000, 0, 1, 0, 0, 0, 2, 0, 0, 0, 300, 500, 1500, 50, 100, 100, 1000, 50, 100, 1500, 3000, 150, 0, 0, 149, 50, 0),
(31, 273.194, -180.671, 1.578, 627.304, -11.979, 1000.92, 'Магазин телефонов', '', 0, 0, 15000, 1, 1, 1, 5025, 0, 23, 0, 0, 0, 100, 100, 200, 300, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 400, 15000, 0),
(32, 1257.58, 204.453, 19.717, 1257.58, 204.453, 19.717, 'Гипермаркет', '', 0, 1, 15000, 0, 1, 0, 5026, 0, 24, 0, 0, 0, 100, 100, 200, 300, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(33, 1244.64, 205.369, 19.645, -794.846, 489.288, 1376.19, 'Ресторан', '', 0, 0, 15000, 0, 1, 1, 5027, 0, 19, 0, 0, 0, 100, 100, 200, 300, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 400, 15000, 0),
(34, 1294.74, 235.618, 19.555, 1165.65, -1012.07, 1083.16, 'Ресторан', '', 0, 0, 15000, 0, 1, 17, 5028, 0, 19, 0, 0, 0, 100, 100, 200, 300, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 400, 15000, 0),
(35, 1370.84, 301.713, 19.739, -2124.3, 3279.94, 95.665, 'Строительная компания', '', 0, 0, 25000, 0, 1, 18, 5029, 0, 20, 0, 0, 0, 100, 100, 200, 300, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 400, 25000, 0),
(36, 293.067, -195.418, 1.779, 2398.67, 2481.57, 74.594, 'Restaurant', '', 0, 0, 15000, 0, 1, 1, 5030, 0, 19, 0, 0, 0, 100, 100, 200, 300, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5139, 400, 15000, 0),
(37, 212.502, -202.448, 1.578, 372.319, -133.524, 1001.49, 'Well Stacked Pizza', '', 0, 0, 20000, 0, 1, 5, 5031, 0, 15, 0, 0, 0, 100, 100, 200, 300, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5154, 400, 20000, 0),
(38, 243.294, -178.432, 1.582, 285.459, -41.805, 1001.52, 'Ammunation ', '', 0, 0, 20000, 0, 1, 1, 5032, 0, 3, 0, 0, 0, 100, 100, 200, 300, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5154, 400, 20000, 0),
(40, 2473.38, -35.342, 26.484, 1332.13, 586.117, 470.216, 'Прачечная', '', 0, 0, 10000, 0, 1, 10, 5033, 0, 0, 0, 0, 0, 100, 100, 200, 300, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 400, 10000, 0),
(41, 2430.07, 111.896, 26.756, 2430.07, 111.896, 26.756, 'Автомастерская', '', 0, 0, 25000, 0, 1, 0, 5034, 0, 7, 0, 0, 0, 100, 100, 200, 300, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 400, 25000, 0),
(42, 693.686, 1967.68, 5.539, 613.974, -31.26, 1268.99, 'Бар/Клуб', '', 0, 0, 15000, 0, 1, 2, 5035, 0, 1, 0, 0, 0, 100, 200, 100, 50, 300, 500, 100, 300, 0, 0, 0, 0, 0, 0, 400, 15000, 0),
(43, 255.494, -158.004, 1.57, 255.494, -158.004, 1.57, 'Рекламное агенство', '', 0, 0, 45000, 0, 1, 0, 5036, 0, 13, 0, 0, 0, 100, 100, 200, 300, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0);

-- --------------------------------------------------------

--
-- Структура таблицы `cars`
--

CREATE TABLE IF NOT EXISTS `cars` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `model` int(3) NOT NULL,
  `color1` int(11) NOT NULL DEFAULT '1',
  `color2` int(11) NOT NULL DEFAULT '1',
  `x` float NOT NULL,
  `y` float NOT NULL,
  `z` float NOT NULL,
  `fa` float NOT NULL,
  `plate` varchar(24) NOT NULL DEFAULT '_',
  `owner` int(11) NOT NULL,
  `armour` float NOT NULL,
  `alarm` int(11) NOT NULL,
  `locks` int(11) NOT NULL,
  `immob` int(11) NOT NULL,
  `insurances` int(11) NOT NULL,
  `destroys` int(11) NOT NULL,
  `impound` int(1) NOT NULL DEFAULT '0',
  `jacking` int(11) NOT NULL,
  `gps` int(11) NOT NULL,
  `fuel` float NOT NULL DEFAULT '0',
  `hidednum` int(11) NOT NULL DEFAULT '0',
  `fakenum` int(11) NOT NULL DEFAULT '0',
  `fakenum_str` varchar(24) NOT NULL,
  `registered` int(11) NOT NULL,
  `comp0` int(11) NOT NULL,
  `comp1` int(11) NOT NULL,
  `comp2` int(11) NOT NULL,
  `comp3` int(11) NOT NULL,
  `comp4` int(11) NOT NULL,
  `comp5` int(11) NOT NULL,
  `comp6` int(11) NOT NULL,
  `comp7` int(11) NOT NULL,
  `comp8` int(11) NOT NULL,
  `comp9` int(11) NOT NULL,
  `comp10` int(11) NOT NULL,
  `comp11` int(11) NOT NULL,
  `comp12` int(11) NOT NULL,
  `comp13` int(11) NOT NULL,
  `paintjob` int(11) NOT NULL DEFAULT '3',
  `radio` int(11) NOT NULL DEFAULT '0',
  `comps` int(11) NOT NULL,
  `health` float NOT NULL DEFAULT '1000',
  `panels` int(11) NOT NULL DEFAULT '0',
  `doors` int(11) NOT NULL DEFAULT '0',
  `lights` int(11) NOT NULL DEFAULT '0',
  `tires` int(11) NOT NULL DEFAULT '0',
  `attach0_pos0` float NOT NULL DEFAULT '0',
  `attach0_pos1` float NOT NULL DEFAULT '0',
  `attach0_pos2` float NOT NULL DEFAULT '0',
  `attach0_rot0` float NOT NULL DEFAULT '0',
  `attach0_rot1` float NOT NULL DEFAULT '0',
  `attach0_rot2` float NOT NULL DEFAULT '0',
  `attach1_pos0` float NOT NULL DEFAULT '0',
  `attach1_pos1` float NOT NULL DEFAULT '0',
  `attach1_pos2` float NOT NULL DEFAULT '0',
  `attach1_rot0` float NOT NULL DEFAULT '0',
  `attach1_rot1` float NOT NULL DEFAULT '0',
  `attach1_rot2` float NOT NULL DEFAULT '0',
  `attach2_pos0` float NOT NULL DEFAULT '0',
  `attach2_pos1` float NOT NULL DEFAULT '0',
  `attach2_pos2` float NOT NULL DEFAULT '0',
  `attach2_rot0` float NOT NULL DEFAULT '0',
  `attach2_rot1` float NOT NULL DEFAULT '0',
  `attach2_rot2` float NOT NULL DEFAULT '0',
  `attach3_pos0` float NOT NULL DEFAULT '0',
  `attach3_pos1` float NOT NULL DEFAULT '0',
  `attach3_pos2` float NOT NULL DEFAULT '0',
  `attach3_rot0` float NOT NULL DEFAULT '0',
  `attach3_rot1` float NOT NULL DEFAULT '0',
  `attach3_rot2` float NOT NULL DEFAULT '0',
  `attach4_pos0` float NOT NULL DEFAULT '0',
  `attach4_pos1` float NOT NULL DEFAULT '0',
  `attach4_pos2` float NOT NULL DEFAULT '0',
  `attach4_rot0` float NOT NULL DEFAULT '0',
  `attach4_rot1` float NOT NULL DEFAULT '0',
  `attach4_rot2` float NOT NULL DEFAULT '0',
  `attach5_pos0` float NOT NULL DEFAULT '0',
  `attach5_pos1` float NOT NULL DEFAULT '0',
  `attach5_pos2` float NOT NULL DEFAULT '0',
  `attach5_rot0` float NOT NULL DEFAULT '0',
  `attach5_rot1` float NOT NULL DEFAULT '0',
  `attach5_rot2` float NOT NULL DEFAULT '0',
  `attach6_pos0` float NOT NULL DEFAULT '0',
  `attach6_pos1` float NOT NULL DEFAULT '0',
  `attach6_pos2` float NOT NULL DEFAULT '0',
  `attach6_rot0` float NOT NULL DEFAULT '0',
  `attach6_rot1` float NOT NULL DEFAULT '0',
  `attach6_rot2` float NOT NULL DEFAULT '0',
  `attach7_pos0` float NOT NULL DEFAULT '0',
  `attach7_pos1` float NOT NULL DEFAULT '0',
  `attach7_pos2` float NOT NULL DEFAULT '0',
  `attach7_rot0` float NOT NULL DEFAULT '0',
  `attach7_rot1` float NOT NULL DEFAULT '0',
  `attach7_rot2` float NOT NULL DEFAULT '0',
  `attach8_pos0` float NOT NULL DEFAULT '0',
  `attach8_pos1` float NOT NULL DEFAULT '0',
  `attach8_pos2` float NOT NULL DEFAULT '0',
  `attach8_rot0` float NOT NULL DEFAULT '0',
  `attach8_rot1` float NOT NULL DEFAULT '0',
  `attach8_rot2` float NOT NULL DEFAULT '0',
  `attach9_pos0` float NOT NULL DEFAULT '0',
  `attach9_pos1` float NOT NULL DEFAULT '0',
  `attach9_pos2` float NOT NULL DEFAULT '0',
  `attach9_rot0` float NOT NULL DEFAULT '0',
  `attach9_rot1` float NOT NULL DEFAULT '0',
  `attach9_rot2` float NOT NULL DEFAULT '0',
  `engine` float NOT NULL DEFAULT '100',
  `engine_time` int(11) NOT NULL DEFAULT '6000',
  `battery` float NOT NULL DEFAULT '100',
  `battery_time` int(11) NOT NULL DEFAULT '6000',
  `milliage` float NOT NULL DEFAULT '0',
  `faction` int(11) NOT NULL,
  `type` int(11) NOT NULL,
  `int` int(11) NOT NULL,
  `vw` int(11) NOT NULL,
  `tax_time` int(11) NOT NULL,
  `date` varchar(24) NOT NULL,
  `inv_1` int(11) NOT NULL,
  `inv_2` int(11) NOT NULL,
  `inv_3` int(11) NOT NULL,
  `inv_4` int(11) NOT NULL,
  `inv_5` int(11) NOT NULL,
  `inv_6` int(11) NOT NULL,
  `inv_7` int(11) NOT NULL,
  `inv_8` int(11) NOT NULL,
  `inv_9` int(11) NOT NULL,
  `inv_10` int(11) NOT NULL,
  `amount_1` int(11) NOT NULL,
  `amount_2` int(11) NOT NULL,
  `amount_3` int(11) NOT NULL,
  `amount_4` int(11) NOT NULL,
  `amount_5` int(11) NOT NULL,
  `amount_6` int(11) NOT NULL,
  `amount_7` int(11) NOT NULL,
  `amount_8` int(11) NOT NULL,
  `amount_9` int(11) NOT NULL,
  `amount_10` int(11) NOT NULL,
  `ex_1` int(11) NOT NULL,
  `ex_2` int(11) NOT NULL,
  `ex_3` int(11) NOT NULL,
  `ex_4` int(11) NOT NULL,
  `ex_5` int(11) NOT NULL,
  `ex_6` int(11) NOT NULL,
  `ex_7` int(11) NOT NULL,
  `ex_8` int(11) NOT NULL,
  `ex_9` int(11) NOT NULL,
  `ex_10` int(11) NOT NULL,
  `s_1` int(11) NOT NULL,
  `s_2` int(11) NOT NULL,
  `s_3` int(11) NOT NULL,
  `s_4` int(11) NOT NULL,
  `s_5` int(11) NOT NULL,
  `s_6` int(11) NOT NULL,
  `s_7` int(11) NOT NULL,
  `s_8` int(11) NOT NULL,
  `s_9` int(11) NOT NULL,
  `s_10` int(11) NOT NULL,
  `car_inv_1` int(11) NOT NULL,
  `car_inv_2` int(11) NOT NULL,
  `car_inv_3` int(11) NOT NULL,
  `car_inv_4` int(11) NOT NULL,
  `car_inv_5` int(11) NOT NULL,
  `car_amount_1` int(11) NOT NULL,
  `car_amount_2` int(11) NOT NULL,
  `car_amount_3` int(11) NOT NULL,
  `car_amount_4` int(11) NOT NULL,
  `car_amount_5` int(11) NOT NULL,
  `car_ex_1` int(11) NOT NULL,
  `car_ex_2` int(11) NOT NULL,
  `car_ex_3` int(11) NOT NULL,
  `car_ex_4` int(11) NOT NULL,
  `car_ex_5` int(11) NOT NULL,
  `car_s_1` int(11) NOT NULL,
  `car_s_2` int(11) NOT NULL,
  `car_s_3` int(11) NOT NULL,
  `car_s_4` int(11) NOT NULL,
  `car_s_5` int(11) NOT NULL,
  `arg_1` int(11) NOT NULL,
  `arg_2` int(11) NOT NULL,
  `arg_3` int(11) NOT NULL,
  `arg_4` int(11) NOT NULL,
  `arg_5` int(11) NOT NULL,
  `arg_6` int(11) NOT NULL,
  `arg_7` int(11) NOT NULL,
  `arg_8` int(11) NOT NULL,
  `arg_9` int(11) NOT NULL,
  `arg_10` int(11) NOT NULL,
  `wanted` int(1) NOT NULL DEFAULT '0',
  `Note1` varchar(128) NOT NULL DEFAULT 'None',
  `Note2` varchar(128) NOT NULL DEFAULT 'None',
  `Note3` varchar(128) NOT NULL DEFAULT 'None',
  `Note4` varchar(128) NOT NULL DEFAULT 'None',
  `Note5` varchar(128) NOT NULL DEFAULT 'None',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 AUTO_INCREMENT=1 ;

-- --------------------------------------------------------

--
-- Структура таблицы `cctvs`
--

CREATE TABLE IF NOT EXISTS `cctvs` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `posx` float NOT NULL,
  `posy` float NOT NULL,
  `posz` float NOT NULL,
  `posrx` float NOT NULL,
  `posry` float NOT NULL,
  `posrz` float NOT NULL,
  `interior` int(11) NOT NULL,
  `virworld` int(11) NOT NULL,
  `break` int(2) NOT NULL,
  `info` varchar(32) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 AUTO_INCREMENT=1 ;

-- --------------------------------------------------------

--
-- Структура таблицы `chemistry`
--

CREATE TABLE IF NOT EXISTS `chemistry` (
  `id` int(11) NOT NULL,
  `building` int(11) NOT NULL,
  `buildingtype` int(11) NOT NULL,
  `furnid` int(11) NOT NULL,
  `isworking` tinyint(1) NOT NULL,
  `worktype` int(11) NOT NULL,
  `time` int(11) NOT NULL,
  `material` int(11) NOT NULL,
  `amount` float NOT NULL,
  `quality` float NOT NULL,
  `type` int(11) NOT NULL,
  `extra0` int(11) NOT NULL,
  `extra1` int(11) NOT NULL,
  `extra2` int(11) NOT NULL,
  `temperature` float NOT NULL,
  `curTemperature` float NOT NULL,
  `degree` float NOT NULL,
  `control` int(11) NOT NULL,
  `ready` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Структура таблицы `chopshop`
--

CREATE TABLE IF NOT EXISTS `chopshop` (
  `id` int(11) NOT NULL,
  `offsetX` int(11) NOT NULL,
  `offsetY` int(11) NOT NULL,
  `offsetZ` int(11) NOT NULL,
  `rotX` int(11) NOT NULL,
  `rotY` int(11) NOT NULL,
  `rotZ` int(11) NOT NULL,
  `faction` int(11) NOT NULL,
  `money` int(11) NOT NULL,
  `vehicles` int(11) NOT NULL,
  `procent` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Структура таблицы `ci_sessions`
--

CREATE TABLE IF NOT EXISTS `ci_sessions` (
  `id` varchar(40) NOT NULL,
  `ip_address` varchar(45) NOT NULL,
  `timestamp` int(10) unsigned NOT NULL DEFAULT '0',
  `data` blob NOT NULL,
  KEY `ci_sessions_timestamp` (`timestamp`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Структура таблицы `criminalrecords`
--

CREATE TABLE IF NOT EXISTS `criminalrecords` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `userid` int(11) NOT NULL DEFAULT '0',
  `arrest` int(2) NOT NULL DEFAULT '0',
  `charge` varchar(128) NOT NULL,
  `date` varchar(32) NOT NULL,
  `officer` varchar(24) NOT NULL,
  `faction` int(1) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 AUTO_INCREMENT=1 ;

-- --------------------------------------------------------

--
-- Структура таблицы `donate`
--

CREATE TABLE IF NOT EXISTS `donate` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT 'Порядковый номер',
  `order_id` int(11) NOT NULL COMMENT 'Номер счета',
  `userid` int(11) NOT NULL COMMENT 'Номер аккаунта',
  `money` int(11) NOT NULL COMMENT 'Сумма',
  `status` int(11) NOT NULL COMMENT 'Статус оплаты',
  `dateCreate` int(11) NOT NULL COMMENT 'Дата платежа',
  `dateDelete` int(11) NOT NULL,
  `crc` text NOT NULL COMMENT 'Подпись',
  `payment` int(11) NOT NULL COMMENT 'Успех или нет',
  `system` int(11) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 AUTO_INCREMENT=1 ;

-- --------------------------------------------------------

--
-- Структура таблицы `drop_chemistry`
--

CREATE TABLE IF NOT EXISTS `drop_chemistry` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `Material` int(10) NOT NULL,
  `Type` int(11) NOT NULL,
  `Amount` float NOT NULL,
  `Quality` float NOT NULL,
  `Extra0` int(11) NOT NULL,
  `Extra1` int(11) NOT NULL,
  `Extra2` int(11) NOT NULL,
  `dropPosX` float NOT NULL,
  `dropPosY` float NOT NULL,
  `dropPosZ` float NOT NULL,
  `dropPosRX` float NOT NULL,
  `dropPosRY` float NOT NULL,
  `dropPosRZ` float NOT NULL,
  `dropInt` int(11) NOT NULL,
  `dropVW` int(11) NOT NULL,
  `dropTime` int(11) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 AUTO_INCREMENT=1 ;

-- --------------------------------------------------------

--
-- Структура таблицы `drop_items`
--

CREATE TABLE IF NOT EXISTS `drop_items` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `item` int(10) NOT NULL,
  `amount` int(11) NOT NULL,
  `a_float` float NOT NULL,
  `dropname` varchar(16) NOT NULL,
  `ex` int(11) NOT NULL,
  `serial` int(11) NOT NULL,
  `dropPosX` float NOT NULL,
  `dropPosY` float NOT NULL,
  `dropPosZ` float NOT NULL,
  `dropPosRX` float NOT NULL,
  `dropPosRY` float NOT NULL,
  `dropPosRZ` float NOT NULL,
  `dropInt` int(11) NOT NULL,
  `dropVW` int(11) NOT NULL,
  `dropTime` int(11) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB  DEFAULT CHARSET=utf8 AUTO_INCREMENT=5 ;

-- --------------------------------------------------------

--
-- Структура таблицы `entrance`
--

CREATE TABLE IF NOT EXISTS `entrance` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `faction` int(11) NOT NULL,
  `enterx` float NOT NULL,
  `entery` float NOT NULL,
  `enterz` float NOT NULL,
  `entera` float NOT NULL,
  `exitx` float NOT NULL,
  `exity` float NOT NULL,
  `exitz` float NOT NULL,
  `exita` float NOT NULL,
  `vehicle` tinyint(1) NOT NULL,
  `exitint` int(11) NOT NULL,
  `exitvw` int(11) NOT NULL,
  `enterint` int(11) NOT NULL,
  `entervw` int(11) NOT NULL,
  `text` varchar(128) NOT NULL,
  `gpsname` varchar(128) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB  DEFAULT CHARSET=utf8 AUTO_INCREMENT=10 ;

--
-- Дамп данных таблицы `entrance`
--

INSERT INTO `entrance` (`id`, `faction`, `enterx`, `entery`, `enterz`, `entera`, `exitx`, `exity`, `exitz`, `exita`, `vehicle`, `exitint`, `exitvw`, `enterint`, `entervw`, `text`, `gpsname`) VALUES
(2, 0, 1241.71, 327.045, 19.756, 162.54, -339.93, 1864.86, 3301.09, 90.641, 0, 13, 0, 0, 0, '~h~Crippen Memorial~n~Hospital', 'Crippen Memorial Hospital'),
(5, 0, 1228.69, 311.976, 19.758, 337.985, -330.723, 1834.57, 3301.09, 172.857, 0, 13, 0, 0, 0, '~h~Crippen Memorial~n~Hospital Rear Entry', ''),
(7, 0, 2225.83, -116.962, 26.748, 171.189, 694.889, 1623.84, 785.549, 91.601, 0, 16, 0, 0, 0, '~g~Red County~n~Sheriff''s Office', 'Red County Sheriff''s Office'),
(8, 0, 2269.65, -74.306, 26.772, 350.974, -8853.14, 2285.46, 98.815, 264.348, 0, 17, 0, 0, 0, '~y~Red County City Library~n~_', 'Red County City Library'),
(9, 0, 621.83, -582.424, 16.115, 182.952, 0, 0, 0, 0, 0, 0, 0, 0, 0, '~h~~y~Dillimore High School~n~~up~', 'Dillimore High School');

-- --------------------------------------------------------

--
-- Структура таблицы `factions`
--

CREATE TABLE IF NOT EXISTS `factions` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `factionid` int(3) DEFAULT '0',
  `shortname` varchar(8) NOT NULL,
  `name` varchar(32) DEFAULT '0',
  `spawnx` float DEFAULT '0',
  `spawny` float DEFAULT '0',
  `spawnz` float DEFAULT '0',
  `spawnint` int(4) DEFAULT '0',
  `rank1` varchar(64) DEFAULT 'None',
  `rank2` varchar(64) DEFAULT 'None',
  `rank3` varchar(64) DEFAULT 'None',
  `rank4` varchar(64) DEFAULT 'None',
  `rank5` varchar(64) DEFAULT 'None',
  `rank6` varchar(64) DEFAULT 'None',
  `rank7` varchar(64) DEFAULT 'None',
  `rank8` varchar(64) DEFAULT 'None',
  `rank9` varchar(64) DEFAULT 'None',
  `rank10` varchar(64) DEFAULT 'None',
  `rank11` varchar(64) DEFAULT 'None',
  `rank12` varchar(64) DEFAULT 'None',
  `rank13` varchar(64) DEFAULT 'None',
  `rank14` varchar(64) DEFAULT 'None',
  `rank15` varchar(64) DEFAULT 'None',
  `rank16` varchar(64) DEFAULT 'None',
  `rank17` varchar(64) DEFAULT 'None',
  `rank18` varchar(64) DEFAULT 'None',
  `rank19` varchar(64) DEFAULT 'None',
  `rank20` varchar(64) DEFAULT 'None',
  `joinrank` int(3) DEFAULT '0',
  `type` int(3) DEFAULT '0',
  `ranks` int(3) DEFAULT '0',
  `chaton` int(2) DEFAULT '0',
  `color` int(11) DEFAULT '0',
  `uniform_x` float DEFAULT '0',
  `uniform_y` float DEFAULT '0',
  `uniform_z` float DEFAULT '0',
  `uniform_int` int(11) DEFAULT '0',
  `uniform_vw` int(11) DEFAULT '0',
  `fix_X` float NOT NULL DEFAULT '0',
  `fix_Y` float NOT NULL DEFAULT '0',
  `fix_Z` float NOT NULL DEFAULT '0',
  `fix_Int` int(11) NOT NULL DEFAULT '0',
  `fix_VW` int(11) NOT NULL DEFAULT '0',
  `spawnvw` int(11) DEFAULT '0',
  `point` int(11) DEFAULT '0',
  `point_time` int(11) DEFAULT '0',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 AUTO_INCREMENT=1 ;

-- --------------------------------------------------------

--
-- Структура таблицы `factories`
--

CREATE TABLE IF NOT EXISTS `factories` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `name` varchar(32) NOT NULL,
  `x` float NOT NULL,
  `y` float NOT NULL,
  `z` float NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB  DEFAULT CHARSET=utf8 AUTO_INCREMENT=2 ;

--
-- Дамп данных таблицы `factories`
--

INSERT INTO `factories` (`id`, `name`, `x`, `y`, `z`) VALUES
(1, '', -311.036, 797.598, 14.69);

-- --------------------------------------------------------

--
-- Структура таблицы `foodstand`
--

CREATE TABLE IF NOT EXISTS `foodstand` (
  `id` int(10) NOT NULL AUTO_INCREMENT,
  `type` tinyint(1) NOT NULL,
  `posx` float NOT NULL,
  `posy` float NOT NULL,
  `posz` float NOT NULL,
  `posrx` float NOT NULL,
  `posry` float NOT NULL,
  `posrz` float NOT NULL,
  `vw` int(11) NOT NULL,
  `interior` int(11) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 AUTO_INCREMENT=1 ;

-- --------------------------------------------------------

--
-- Структура таблицы `furnitures`
--

CREATE TABLE IF NOT EXISTS `furnitures` (
  `id` int(10) NOT NULL AUTO_INCREMENT,
  `model` int(10) NOT NULL,
  `name` varchar(64) NOT NULL,
  `bType` int(11) NOT NULL,
  `building` int(5) NOT NULL,
  `interior` int(4) NOT NULL,
  `virworld` int(4) NOT NULL,
  `marketprice` int(4) NOT NULL,
  `posx` float NOT NULL,
  `posy` float NOT NULL,
  `posz` float NOT NULL,
  `posrx` float NOT NULL,
  `posry` float NOT NULL,
  `posrz` float NOT NULL,
  `texture_0` int(11) NOT NULL DEFAULT '-1',
  `texture_1` int(11) NOT NULL DEFAULT '-1',
  `texture_2` int(11) NOT NULL DEFAULT '-1',
  `texture_3` int(11) NOT NULL DEFAULT '-1',
  `texture_4` int(11) NOT NULL DEFAULT '-1',
  `category` int(11) NOT NULL,
  `ChemIdx` int(11) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 AUTO_INCREMENT=1 ;

-- --------------------------------------------------------

--
-- Структура таблицы `garage`
--

CREATE TABLE IF NOT EXISTS `garage` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `owner` int(11) NOT NULL,
  `price` int(11) NOT NULL,
  `house` int(11) NOT NULL,
  `biz` int(11) NOT NULL,
  `ddoor` int(11) NOT NULL,
  `player_enter_x` float NOT NULL,
  `player_enter_y` float NOT NULL,
  `player_enter_z` float NOT NULL,
  `player_exit_x` float NOT NULL,
  `player_exit_y` float NOT NULL,
  `player_exit_z` float NOT NULL,
  `veh_enter_x` float NOT NULL,
  `veh_enter_y` float NOT NULL,
  `veh_enter_z` float NOT NULL,
  `veh_enter_fa` float NOT NULL,
  `veh_exit_x` float NOT NULL,
  `veh_exit_y` float NOT NULL,
  `veh_exit_z` float NOT NULL,
  `veh_exit_fa` float NOT NULL,
  `exit_int` int(11) NOT NULL,
  `locked` tinyint(1) NOT NULL,
  `enter_int` int(11) NOT NULL,
  `enter_vw` int(11) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB  DEFAULT CHARSET=utf8 AUTO_INCREMENT=2 ;

--
-- Дамп данных таблицы `garage`
--

INSERT INTO `garage` (`id`, `owner`, `price`, `house`, `biz`, `ddoor`, `player_enter_x`, `player_enter_y`, `player_enter_z`, `player_exit_x`, `player_exit_y`, `player_exit_z`, `veh_enter_x`, `veh_enter_y`, `veh_enter_z`, `veh_enter_fa`, `veh_exit_x`, `veh_exit_y`, `veh_exit_z`, `veh_exit_fa`, `exit_int`, `locked`, `enter_int`, `enter_vw`) VALUES
(1, 0, 10000, 206, 0, 0, 1365.42, 22.412, 34.368, 620.134, -70.9, 997.992, 1365.42, 22.412, 34.368, 1365.42, 22.412, 34.368, 0, 615.49, -1030314328, 0, 1148808349, 1118681707);

-- --------------------------------------------------------

--
-- Структура таблицы `gates`
--

CREATE TABLE IF NOT EXISTS `gates` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `model` int(11) NOT NULL,
  `faction` int(11) NOT NULL,
  `posx` float NOT NULL,
  `posy` float NOT NULL,
  `posz` float NOT NULL,
  `posrx` float NOT NULL,
  `posry` float NOT NULL,
  `posrz` float NOT NULL,
  `speed` float NOT NULL DEFAULT '0.5',
  `radius` float NOT NULL DEFAULT '5',
  `movex` float NOT NULL,
  `movey` float NOT NULL,
  `movez` float NOT NULL,
  `moverx` float NOT NULL,
  `movery` float NOT NULL,
  `moverz` float NOT NULL,
  `interior` int(11) NOT NULL,
  `virworld` int(11) NOT NULL,
  `name` varchar(32) NOT NULL,
  `sound` int(11) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 AUTO_INCREMENT=1 ;

-- --------------------------------------------------------

--
-- Структура таблицы `graffities`
--

CREATE TABLE IF NOT EXISTS `graffities` (
  `id` int(11) NOT NULL,
  `text` varchar(32) NOT NULL,
  `color` int(16) NOT NULL,
  `back_color` int(16) NOT NULL,
  `font` varchar(16) NOT NULL,
  `font_size` int(11) NOT NULL,
  `bold` int(11) NOT NULL,
  `creator` varchar(32) NOT NULL,
  `c_date` varchar(64) NOT NULL,
  `posx` float NOT NULL,
  `posy` float NOT NULL,
  `posz` float NOT NULL,
  `rotx` float NOT NULL,
  `roty` float NOT NULL,
  `rotz` float NOT NULL,
  `gotox` float NOT NULL,
  `gotoy` float NOT NULL,
  `gotoz` float NOT NULL,
  `interior` int(11) NOT NULL,
  `world` int(11) NOT NULL,
  `accepted` int(11) NOT NULL,
  `acceptor` varchar(32) NOT NULL,
  `a_date` varchar(64) NOT NULL,
  UNIQUE KEY `id` (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Структура таблицы `history_calls`
--

CREATE TABLE IF NOT EXISTS `history_calls` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `to_number` int(11) NOT NULL,
  `from_number` int(11) NOT NULL,
  `date_hour` varchar(24) NOT NULL,
  `date_month` varchar(24) NOT NULL,
  `to_name` varchar(24) NOT NULL,
  `from_name` varchar(24) NOT NULL,
  `time` int(11) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB  DEFAULT CHARSET=utf8 AUTO_INCREMENT=3 ;

--
-- Дамп данных таблицы `history_calls`
--

INSERT INTO `history_calls` (`id`, `to_number`, `from_number`, `date_hour`, `date_month`, `to_name`, `from_name`, `time`) VALUES
(1, 944112, 413107, '16:13', 'Июль 20, 2020', '413107', '944112', 70),
(2, 944112, 413107, '16:13', 'Июль 20, 2020', '', '944112', 70);

-- --------------------------------------------------------

--
-- Структура таблицы `houses`
--

CREATE TABLE IF NOT EXISTS `houses` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `street` varchar(64) NOT NULL,
  `posx` float NOT NULL,
  `posy` float NOT NULL,
  `posz` float NOT NULL,
  `exitx` float NOT NULL,
  `exity` float NOT NULL,
  `exitz` float NOT NULL,
  `class` int(11) NOT NULL,
  `apartments` int(11) NOT NULL,
  `owner` int(11) NOT NULL,
  `locked` int(2) NOT NULL,
  `price` int(11) NOT NULL,
  `levelbuy` int(11) NOT NULL,
  `cash` int(11) NOT NULL,
  `checkx` float NOT NULL,
  `checky` float NOT NULL,
  `checkz` float NOT NULL,
  `radio` int(2) NOT NULL,
  `lock` int(2) NOT NULL,
  `alarm` int(2) NOT NULL,
  `door` int(2) NOT NULL,
  `ddoor` int(2) NOT NULL,
  `posint` int(11) NOT NULL,
  `posvw` int(11) NOT NULL,
  `exitint` int(11) NOT NULL,
  `exitvw` int(11) NOT NULL,
  `heal` tinyint(1) NOT NULL,
  `heal_amount` tinyint(1) NOT NULL,
  `cupboard` tinyint(1) NOT NULL,
  `skin_0` int(11) NOT NULL,
  `skin_1` int(11) NOT NULL,
  `skin_2` int(11) NOT NULL,
  `furniture_radius` float NOT NULL DEFAULT '7',
  `ext_ENposX` float NOT NULL,
  `ext_ENposY` float NOT NULL,
  `ext_ENposZ` float NOT NULL,
  `ext_ENint` int(11) NOT NULL,
  `ext_ENvw` int(11) NOT NULL,
  `ext_EXposX` float NOT NULL,
  `ext_EXposY` float NOT NULL,
  `ext_EXposZ` float NOT NULL,
  `ext_EXint` int(11) NOT NULL,
  `ext_EXvw` int(11) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB  DEFAULT CHARSET=utf8 AUTO_INCREMENT=228 ;

--
-- Дамп данных таблицы `houses`
--

INSERT INTO `houses` (`id`, `street`, `posx`, `posy`, `posz`, `exitx`, `exity`, `exitz`, `class`, `apartments`, `owner`, `locked`, `price`, `levelbuy`, `cash`, `checkx`, `checky`, `checkz`, `radio`, `lock`, `alarm`, `door`, `ddoor`, `posint`, `posvw`, `exitint`, `exitvw`, `heal`, `heal_amount`, `cupboard`, `skin_0`, `skin_1`, `skin_2`, `furniture_radius`, `ext_ENposX`, `ext_ENposY`, `ext_ENposZ`, `ext_ENint`, `ext_ENvw`, `ext_EXposX`, `ext_EXposY`, `ext_EXposZ`, `ext_EXint`, `ext_EXvw`) VALUES
(17, '', 201.315, -96.972, 4.896, 2284.81, -1126.49, 1050.92, 0, 0, 0, 1, 6500, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 10, 5000, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(18, '', 189.383, -96.972, 4.896, 2284.81, -1126.49, 1050.92, 0, 0, 0, 1, 6500, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 10, 5001, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(19, '', 207.076, -112.313, 4.896, 2284.81, -1126.49, 1050.92, 0, 0, 0, 1, 6500, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 10, 5002, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(20, '', 201.452, -118.235, 4.896, 2284.81, -1126.49, 1050.92, 0, 0, 0, 1, 6500, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 10, 5003, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(21, '', 201.336, -94.973, 1.555, 2284.81, -1126.49, 1050.92, 0, 0, 0, 1, 6500, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 10, 5004, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(22, '', 209.086, -112.589, 1.551, 2284.81, -1126.49, 1050.92, 0, 0, 0, 1, 6500, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 10, 5005, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(23, '', 201.4, -120.235, 1.551, 2284.81, -1126.49, 1050.92, 0, 0, 0, 1, 6500, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 10, 5006, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(24, '', 189.482, -120.233, 1.549, 2284.81, -1126.49, 1050.92, 0, 0, 0, 1, 6500, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 10, 5007, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(25, '', 178.346, -120.234, 1.549, 2284.81, -1126.49, 1050.92, 0, 0, 0, 1, 6500, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 10, 5008, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(26, '', 166.291, -120.235, 1.555, 2284.81, -1126.49, 1050.92, 0, 0, 0, 1, 6500, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 10, 5009, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(27, '', 158.632, -112.637, 1.557, 2284.81, -1126.49, 1050.92, 0, 0, 0, 1, 6500, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 10, 5010, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(28, '', 158.631, -102.601, 1.557, 2260.73, -1121.14, 1048.89, 0, 0, 0, 1, 6500, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 10, 5011, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(29, '', 166.35, -94.972, 1.555, 2260.73, -1121.14, 1048.89, 0, 0, 0, 1, 6500, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 10, 5012, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(30, '', 160.632, -112.605, 4.896, 2260.73, -1121.14, 1048.89, 0, 0, 0, 1, 6500, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 10, 5013, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(31, '', 166.289, -118.234, 4.896, 2260.73, -1121.14, 1048.89, 0, 0, 0, 1, 6500, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 10, 5014, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(32, '', 178.345, -118.234, 4.896, 2260.73, -1121.14, 1048.89, 0, 0, 0, 1, 6500, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 10, 5015, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(33, '', 160.633, -102.57, 4.896, 2260.73, -1121.14, 1048.89, 0, 0, 0, 1, 6500, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 10, 5016, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(34, '', 166.301, -96.972, 4.896, 2260.73, -1121.14, 1048.89, 0, 0, 0, 1, 6500, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 10, 5017, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(35, '', 178.34, -96.972, 4.896, 2260.73, -1121.14, 1048.89, 0, 0, 0, 1, 6500, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 10, 5018, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(38, '', 253.23, -289.897, 1.703, 2081.13, 2345.47, -89.195, 0, 0, 0, 1, 3500, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 55, 5019, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(39, '', 242.08, -298.601, 1.687, 2081.13, 2345.47, -89.195, 0, 0, 0, 1, 3500, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 55, 5020, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(40, '', 235.197, -309.456, 1.711, 2081.13, 2345.47, -89.195, 0, 0, 0, 1, 3500, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 55, 5021, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(41, '', 226.423, -302.812, 1.926, 2081.13, 2345.47, -89.195, 0, 0, 0, 1, 3500, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 55, 5022, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(42, '', 260.553, -303.034, 1.918, 2081.13, 2345.47, -89.195, 0, 0, 0, 1, 3500, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 55, 5023, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(43, '', 264.514, -288.38, 1.726, 2081.13, 2345.47, -89.195, 0, 0, 0, 1, 3500, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 55, 5024, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(44, '', 264.507, -283.653, 1.726, 2081.13, 2345.47, -89.195, 0, 0, 0, 1, 3500, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 55, 5025, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(45, '', 261.98, -270.003, 1.64, 2081.13, 2345.47, -89.195, 0, 0, 0, 1, 3500, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 55, 5026, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(46, '', 253.542, -274.561, 1.656, 2081.13, 2345.47, -89.195, 0, 0, 0, 1, 3500, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 55, 5027, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(47, '', 255.91, -278.531, 1.656, 2081.13, 2345.47, -89.195, 0, 0, 0, 1, 3500, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 55, 5028, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(48, '', 241.628, -282.459, 1.633, 2081.13, 2345.47, -89.195, 0, 0, 0, 1, 3500, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 55, 5029, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(49, '', 238.952, -286.243, 1.633, 2081.13, 2345.47, -89.195, 0, 0, 0, 1, 3500, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 55, 5030, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(50, '', 253.863, -163.971, 5.079, 745.101, 1412.19, 1102.43, 2, 0, 0, 1, 45000, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 10, 5031, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(69, '', 215.19, -260.759, 3.998, 2081.13, 2345.47, -89.195, 0, 0, 0, 1, 6500, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 55, 5037, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(71, '', 215.19, -242.162, 3.998, 2081.13, 2345.47, -89.195, 0, 0, 0, 1, 6500, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 55, 5035, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(72, '', 215.19, -242.16, 0.671, 2081.13, 2345.47, -89.195, 0, 0, 0, 1, 6500, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 55, 5034, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(74, '', 215.193, -260.775, 0.671, 2081.13, 2345.47, -89.195, 0, 0, 0, 1, 6500, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 55, 5032, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(76, '', 1776.56, -1536.32, 1186.48, 2081.13, 2345.47, -89.195, 0, 0, 0, 1, 6500, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 14, 1000, 55, 5038, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(77, '', 1782.76, -1536.88, 1186.48, 2081.13, 2345.47, -89.195, 0, 0, 0, 1, 6500, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 14, 1000, 55, 5039, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(78, '', 1782.78, -1533.35, 1186.48, 2081.13, 2345.47, -89.195, 0, 0, 0, 1, 6500, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 14, 1000, 55, 5040, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(79, '', 1780.3, -1533.45, 1186.48, 2081.13, 2345.47, -89.195, 0, 0, 0, 1, 6500, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 14, 1000, 55, 5041, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(80, '', 1780.3, -1529.87, 1186.48, 2081.13, 2345.47, -89.195, 0, 0, 0, 1, 6500, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 14, 1000, 55, 5042, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(81, '', 1782.75, -1529.47, 1186.48, 2081.13, 2345.47, -89.195, 0, 0, 0, 1, 6500, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 14, 1000, 55, 5043, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(82, '', 1782.77, -1525.38, 1186.48, 2081.13, 2345.47, -89.195, 0, 0, 0, 1, 6500, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 14, 1000, 55, 5044, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(83, '', 1778.66, -1523.62, 1186.48, 2081.13, 2345.47, -89.195, 0, 0, 0, 1, 6500, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 14, 1000, 55, 5045, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(84, '', 1777.72, -1526.05, 1186.48, 2081.13, 2345.47, -89.195, 0, 0, 0, 1, 6500, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 14, 1000, 55, 5046, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(85, '', 1775.27, -1523.61, 1186.48, 2081.13, 2345.47, -89.195, 0, 0, 0, 1, 6500, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 14, 1000, 55, 5047, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(86, '', 1771.55, -1523.6, 1186.48, 2081.13, 2345.47, -89.195, 0, 0, 0, 1, 6500, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 14, 1000, 55, 5048, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(87, '', 1769.42, -1526.11, 1186.48, 2081.13, 2345.47, -89.195, 0, 0, 0, 1, 6500, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 14, 1000, 55, 5049, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(88, '', 1772.33, -1529.55, 1186.48, 2081.13, 2345.47, -89.195, 0, 0, 0, 1, 6500, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 14, 1000, 55, 5050, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(89, '', 1769.42, -1530.4, 1186.48, 2081.13, 2345.47, -89.195, 0, 0, 0, 1, 6500, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 14, 1000, 55, 5051, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(90, '', 1768.05, -1526.46, 1189.99, 2081.13, 2345.47, -89.195, 0, 0, 0, 1, 6500, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 14, 1000, 55, 5052, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(91, '', 1768.04, -1522.21, 1189.99, 2081.13, 2345.47, -89.195, 0, 0, 0, 1, 6500, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 14, 1000, 55, 5053, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(92, '', 1779.57, -1536.23, 1189.99, 2081.13, 2345.47, -89.195, 0, 0, 0, 1, 6500, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 14, 1000, 55, 5054, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(93, '', 1784.21, -1536.25, 1189.99, 2081.13, 2345.47, -89.195, 0, 0, 0, 1, 6500, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 14, 1000, 55, 5055, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(94, '', 1785.06, -1538.23, 1189.99, 2081.13, 2345.47, -89.195, 0, 0, 0, 1, 6500, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 14, 1000, 55, 5056, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(95, '', 1781.36, -1538.23, 1189.99, 2081.13, 2345.47, -89.195, 0, 0, 0, 1, 6500, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 14, 1000, 55, 5057, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(100, '', 321.314, -171.424, 1.587, -79.946, 1383.22, 1078.95, 1, 0, 0, 1, 13000, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 10, 5059, 0, 0, 0, 0, 0, 0, 7, 314.213, -171.413, 1.587, 0, 0, 0, 0, 0, 0, 0),
(101, '', 321.314, -168.162, 1.587, -79.946, 1383.22, 1078.95, 1, 0, 0, 1, 13000, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 10, 5058, 0, 0, 0, 0, 0, 0, 7, 314.213, -168.175, 1.587, 0, 0, 0, 0, 0, 0, 0),
(102, '', 321.314, -176.206, 1.587, -79.946, 1383.22, 1078.95, 1, 0, 0, 1, 13000, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 10, 5060, 0, 0, 0, 0, 0, 0, 7, 314.213, -176.171, 1.587, 0, 0, 0, 0, 0, 0, 0),
(103, '', 321.324, -182.034, 1.587, -79.946, 1383.22, 1078.95, 1, 0, 0, 1, 13000, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 10, 5061, 0, 0, 0, 0, 0, 0, 7, 314.223, -181.946, 1.587, 0, 0, 0, 0, 0, 0, 0),
(104, '', 321.324, -185.21, 1.597, -79.946, 1383.22, 1078.95, 1, 0, 0, 1, 13000, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 10, 5062, 0, 0, 0, 0, 0, 0, 7, 314.223, -185.174, 1.617, 0, 0, 0, 0, 0, 0, 0),
(105, '', 321.325, -190.073, 1.597, -79.946, 1383.22, 1078.95, 1, 0, 0, 1, 13000, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 10, 5063, 0, 0, 0, 0, 0, 0, 7, 314.223, -190.018, 1.617, 0, 0, 0, 0, 0, 0, 0),
(106, '', 253.246, -22.278, 1.634, 2081.13, 2345.47, -89.195, 0, 0, 0, 1, 10000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 55, 5064, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(107, '', 248.711, -33.202, 1.578, 2081.13, 2345.47, -89.195, 0, 0, 0, 1, 10000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 55, 5065, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(108, '', 348.495, -105.652, 3.934, 2081.13, 2345.47, -89.195, 0, 0, 0, 1, 6500, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 55, 5066, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(109, '', 348.496, -110.45, 3.934, 2081.13, 2345.47, -89.195, 0, 0, 0, 1, 6500, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 55, 5067, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(110, '', 348.181, -114.435, 3.934, 2081.13, 2345.47, -89.195, 0, 0, 0, 1, 6500, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 55, 5068, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(111, '', 348.496, -105.674, 1.379, 2081.13, 2345.47, -89.195, 0, 0, 0, 1, 6500, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 55, 5069, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(112, '', 348.496, -110.507, 1.379, 2081.13, 2345.47, -89.195, 0, 0, 0, 1, 6500, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 55, 5070, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(113, '', 348.163, -114.435, 1.576, 2081.13, 2345.47, -89.195, 0, 0, 0, 1, 6500, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 55, 5071, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(114, '', 366.107, -111.545, 1.346, 2081.13, 2345.47, -89.195, 0, 0, 0, 1, 6500, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 55, 5072, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(115, '', 362.15, -111.221, 1.576, 2081.13, 2345.47, -89.195, 0, 0, 0, 1, 6500, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 55, 5073, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(116, '', 370.954, -111.545, 1.356, 2081.13, 2345.47, -89.195, 0, 0, 0, 1, 6500, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 55, 5074, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(117, '', 370.877, -111.544, 3.934, 2081.13, 2345.47, -89.195, 0, 0, 0, 1, 6500, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 55, 5075, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(118, '', 366.124, -111.544, 3.934, 2081.13, 2345.47, -89.195, 0, 0, 0, 1, 6500, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 55, 5076, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(119, '', 362.149, -111.232, 3.934, 2081.13, 2345.47, -89.195, 0, 0, 0, 1, 6500, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 55, 5077, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(120, '', 309.105, 44.415, 3.088, 2335.29, -1047.32, 44.7, 0, 0, 0, 1, 3500, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 54, 5078, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(121, '', 317.741, 54.613, 3.375, 2335.29, -1047.32, 44.7, 0, 0, 0, 1, 3500, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 54, 5079, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(122, '', 286.166, 41.193, 2.548, 2335.29, -1047.32, 44.7, 0, 0, 0, 1, 3500, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 54, 5080, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(123, '', 342.595, 62.755, 3.863, 2335.29, -1047.32, 44.7, 0, 0, 0, 1, 3500, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 54, 5081, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(124, '', 340.071, 33.598, 6.408, 2335.29, -1047.32, 44.7, 0, 0, 0, 1, 3500, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 54, 5082, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(125, '', 316.477, 18.246, 4.516, 2335.29, -1047.32, 44.7, 0, 0, 0, 1, 3500, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 54, 5083, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(126, '', 2246.16, 111.24, 29.876, 0, 0, 0, 0, 0, 0, 1, 7500, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5084, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(127, '', 2237.31, 111.298, 29.876, 0, 0, 0, 0, 0, 0, 1, 7500, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5085, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(128, '', 2249.05, 111.313, 29.876, 0, 0, 0, 0, 0, 0, 1, 7500, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5086, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(129, '', 2260.79, 111.214, 29.876, 0, 0, 0, 0, 0, 0, 1, 7500, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5087, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(130, '', 2257.9, 111.261, 29.876, 0, 0, 0, 0, 0, 0, 1, 7500, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5088, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(131, '', 2272.53, 111.292, 29.876, 0, 0, 0, 0, 0, 0, 1, 7500, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5089, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(132, '', 2269.64, 111.271, 29.876, 0, 0, 0, 0, 0, 0, 1, 7500, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5090, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(133, '', 1725.25, 61.137, 29.598, 0, 0, 0, 0, 0, 0, 1, 2000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5091, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(134, '', 1764.71, 340.454, 19.58, 0, 0, 0, 0, 0, 0, 1, 5000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5092, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(135, '', 1451.56, 375.796, 19.4, 0, 0, 0, 0, 0, 0, 1, 5000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5093, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(136, '', 1465.81, 364.164, 19.262, 0, 0, 0, 0, 0, 0, 1, 5000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5094, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(137, '', 1475.29, 372.755, 19.656, 0, 0, 0, 0, 0, 0, 1, 5000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5095, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(138, '', 1469.63, 351.53, 18.927, 0, 0, 0, 0, 0, 0, 1, 5000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5096, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(139, '', 1461.06, 342.455, 18.953, 0, 0, 0, 0, 0, 0, 1, 5000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5097, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(140, '', 1434.91, 334.823, 18.947, 0, 0, 0, 0, 0, 0, 1, 5000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5098, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(141, '', 1415.88, 324.627, 18.844, 0, 0, 0, 0, 0, 0, 1, 5000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5099, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(142, '', 1403.23, 333.844, 18.906, 0, 0, 0, 0, 0, 0, 1, 5000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5100, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(143, '', 1409.34, 346.867, 19.252, 0, 0, 0, 0, 0, 0, 1, 5000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5101, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(144, '', 1283.31, 158.368, 20.793, 0, 0, 0, 0, 0, 0, 1, 3500, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5102, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(145, '', 1299.17, 140.34, 20.539, 0, 0, 0, 0, 0, 0, 1, 3500, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5103, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(146, '', 1294.51, 157.627, 20.578, 0, 0, 0, 0, 0, 0, 1, 3500, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5104, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(147, '', 1295.45, 174.639, 20.911, 0, 0, 0, 0, 0, 0, 1, 4000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5105, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(148, '', 1303.56, 186.07, 20.539, 0, 0, 0, 0, 0, 0, 1, 3500, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5106, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(149, '', 1296.33, 191.043, 20.523, 0, 0, 0, 0, 0, 0, 1, 3500, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5107, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(150, '', 1315.61, 180.062, 20.555, 0, 0, 0, 0, 0, 0, 1, 3500, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5108, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(151, '', 1311.97, 169.498, 20.631, 0, 0, 0, 0, 0, 0, 1, 4000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5109, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(152, '', 1307.27, 153.275, 20.492, 0, 0, 0, 0, 0, 0, 1, 3500, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5110, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(153, '', 746.391, 305.042, 20.234, 0, 0, 0, 0, 0, 0, 1, 5500, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5111, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(154, '', 719.089, 300.494, 20.377, 0, 0, 0, 0, 0, 0, 1, 5500, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5112, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(155, '', 705.382, 292.091, 20.422, 0, 0, 0, 0, 0, 0, 1, 5000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5113, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(156, '', 748.389, 350.872, 20.586, 0, 0, 0, 0, 0, 0, 1, 3500, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5114, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(157, '', 751.719, 375.248, 23.375, 0, 0, 0, 0, 0, 0, 1, 3500, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5115, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(158, '', 758.9, 375.083, 23.392, 0, 0, 0, 0, 0, 0, 1, 4500, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5116, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(159, '', 783.127, 377.576, 21.297, 0, 0, 0, 0, 0, 0, 1, 4000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5117, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(160, '', 808.084, 372.403, 19.453, 0, 0, 0, 0, 0, 0, 1, 3800, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5118, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(161, '', 805.539, 358.357, 19.762, 0, 0, 0, 0, 0, 0, 1, 4800, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5119, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(162, '', 783.943, 352.597, 19.594, 0, 0, 0, 0, 0, 0, 1, 4500, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5120, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(163, '', 772.928, 348.224, 20.153, 0, 0, 0, 0, 0, 0, 1, 5000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5121, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(164, '', 747.241, 278.447, 27.219, 0, 0, 0, 0, 0, 0, 1, 4600, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5122, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(165, '', 748.249, 257.128, 27.086, 0, 0, 0, 0, 0, 0, 1, 4600, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5123, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(166, '', 723.635, 269.677, 22.453, 0, 0, 0, 0, 0, 0, 1, 4000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5124, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(167, '', 317.749, 54.626, 3.375, 0, 0, 0, 0, 0, 0, 1, 4000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5125, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(168, '', 308.98, 44.352, 3.088, 0, 0, 0, 0, 0, 0, 1, 4200, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5126, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(169, '', 286.033, 41.138, 2.548, 0, 0, 0, 0, 0, 0, 1, 5000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5127, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(170, '', 342.639, 62.703, 3.863, 0, 0, 0, 0, 0, 0, 1, 5000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5128, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(171, '', 340.045, 33.631, 6.408, 0, 0, 0, 0, 0, 0, 1, 4500, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5129, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(172, '', 316.417, 18.234, 4.516, 0, 0, 0, 0, 0, 0, 1, 4000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5130, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(173, '', 253.154, -22.278, 1.634, 0, 0, 0, 0, 0, 0, 1, 4500, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5131, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(175, '', 2364, 116.091, 28.442, 0, 0, 0, 0, 0, 0, 1, 25000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5133, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(176, '', 1419.88, 389.846, 19.285, 2335.29, -1047.32, 44.7, 0, 0, 0, 1, 5000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 54, 5134, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(177, '', 1447.46, 361.732, 18.908, 2335.29, -1047.32, 44.7, 0, 0, 0, 1, 5000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 54, 5135, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(178, '', 1488.52, 361.043, 19.415, 2335.29, -1047.32, 44.7, 0, 0, 0, 1, 5000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 54, 5136, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(179, '', 1428.55, 356.473, 18.875, 2335.29, -1047.32, 44.7, 0, 0, 0, 1, 5000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 54, 5137, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(180, '', 1413.1, 363.038, 19.199, 2335.29, -1047.32, 44.7, 0, 0, 0, 1, 5000, 0, 0, 0, 0, 0, 0, 5, 0, 2, 0, 0, 0, 54, 5138, 5, 3, 1, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(181, '', 1388.85, 19.816, 34.623, 2335.29, -1047.32, 44.7, 0, 0, 0, 1, 20000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 54, 5139, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(182, '', 253.34, -22.277, 1.634, 2335.29, -1047.32, 44.7, 0, -1, 0, 1, 7000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5139, 54, 5140, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(183, '', 252.888, -92.26, 3.535, 329.309, 1512.79, 1085.81, 1, -1, 0, 1, 38000, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5139, 10, 5141, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(184, '', 207.076, -112.28, 4.896, 0, 0, 0, 0, -1, 0, 1, 13000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5139, 0, 5142, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(185, '', 201.672, -118.234, 4.896, 0, 0, 0, 2, -1, 0, 1, 13000, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5139, 0, 5143, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(186, '', 253.48, -22.274, 1.634, 0, 0, 0, 0, -1, 0, 1, 13000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5143, 0, 5144, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(187, '', 253.329, -22.277, 1.634, 2335.29, -1047.32, 44.7, 0, -1, 0, 1, 13000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5144, 54, 5145, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(198, '', 818.256, -509.319, 18.013, 46.074, 1439.4, 1082.42, 1, 0, 0, 1, 25000, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 10, 5156, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(199, '', 795.191, -506.149, 18.013, -48.146, 1458.48, 1085.61, 1, 0, 0, 1, 23000, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 10, 5157, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(200, '', 768.363, -503.481, 18.013, 46.074, 1439.4, 1082.42, 1, 0, 0, 1, 25000, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 10, 5158, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(201, '', 766.427, -556.785, 18.013, -79.946, 1383.22, 1078.95, 1, 0, 0, 1, 25000, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 10, 5159, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(205, '', 1407.05, 39.668, 33.871, -48.146, 1458.48, 1085.61, 1, 0, 0, 1, 23000, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 10, 5158, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(206, '', 1369.93, 3.518, 35.274, 46.074, 1439.4, 1082.42, 1, 0, 0, 1, 24000, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 10, 5159, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(212, '', 784.178, 1954.35, 5.707, 0, 0, 0, 0, 0, 0, 1, 3000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5149, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(213, '', 751.094, 1959.6, 5.461, 0, 0, 0, 0, 0, 0, 1, 3000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5150, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(214, '', 753.693, 1973.3, 5.7, 0, 0, 0, 0, 0, 0, 1, 3000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5151, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(215, '', 766.888, 1989.78, 5.445, 0, 0, 0, 0, 0, 0, 1, 3000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5152, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(216, '', 767.642, 2007.62, 6.067, 0, 0, 0, 0, 0, 0, 1, 3000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5153, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(217, '', 793.424, 1991.83, 5.793, 0, 0, 0, 0, 0, 0, 1, 3000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5154, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(218, '', 790.067, 1973.95, 5.739, 0, 0, 0, 0, 0, 0, 1, 3000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5155, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(219, '', 778.038, 1937.59, 5.578, 0, 0, 0, 0, 0, 0, 1, 3000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5156, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(220, '', 1350.39, -9.158, 35.927, -79.946, 1383.22, 1078.95, 1, 0, 0, 1, 40000, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 10, 5157, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(222, '', 1566.83, 23.185, 24.164, 0, 0, 0, 2, 0, 0, 1, 50000, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5158, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(223, '', 2203.85, 62.114, 28.442, -79.946, 1383.22, 1078.95, 1, 0, 0, 1, 25000, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 10, 5159, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(225, '', 2203.85, 106.152, 28.442, -79.946, 1383.22, 1078.95, 1, 0, 0, 1, 25000, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 10, 5160, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(226, '', 2236.6, 168.303, 28.154, 0, 0, 0, 2, 0, 0, 1, 45000, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5161, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(227, '', 2548.59, 25.123, 27.676, 2081.13, 2345.47, -89.195, 0, 0, 0, 1, 100, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 55, 5162, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0);

-- --------------------------------------------------------

--
-- Структура таблицы `ic_news`
--

CREATE TABLE IF NOT EXISTS `ic_news` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `date` datetime NOT NULL,
  `text` varchar(2000) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL,
  `author` text NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 AUTO_INCREMENT=1 ;

-- --------------------------------------------------------

--
-- Структура таблицы `inventory`
--

CREATE TABLE IF NOT EXISTS `inventory` (
  `userid` int(11) NOT NULL DEFAULT '-1',
  `houseid` int(11) NOT NULL DEFAULT '-1',
  `trunkid` int(11) NOT NULL DEFAULT '-1',
  `carid` int(11) NOT NULL DEFAULT '-1',
  `id_1` int(11) NOT NULL DEFAULT '0',
  `id_2` int(11) NOT NULL DEFAULT '0',
  `id_3` int(11) NOT NULL DEFAULT '0',
  `id_4` int(11) NOT NULL DEFAULT '0',
  `id_5` int(11) NOT NULL DEFAULT '0',
  `id_6` int(11) NOT NULL DEFAULT '0',
  `id_7` int(11) NOT NULL DEFAULT '0',
  `id_8` int(11) NOT NULL DEFAULT '0',
  `id_9` int(11) NOT NULL DEFAULT '0',
  `id_10` int(11) NOT NULL DEFAULT '0',
  `id_11` int(11) NOT NULL DEFAULT '0',
  `id_12` int(11) NOT NULL DEFAULT '0',
  `id_13` int(11) NOT NULL DEFAULT '0',
  `id_14` int(11) NOT NULL DEFAULT '0',
  `id_15` int(11) NOT NULL DEFAULT '0',
  `a_1` int(11) NOT NULL DEFAULT '0',
  `a_2` int(11) NOT NULL DEFAULT '0',
  `a_3` int(11) NOT NULL DEFAULT '0',
  `a_4` int(11) NOT NULL DEFAULT '0',
  `a_5` int(11) NOT NULL DEFAULT '0',
  `a_6` int(11) NOT NULL DEFAULT '0',
  `a_7` int(11) NOT NULL DEFAULT '0',
  `a_8` int(11) NOT NULL DEFAULT '0',
  `a_9` int(11) NOT NULL DEFAULT '0',
  `a_10` int(11) NOT NULL DEFAULT '0',
  `a_11` int(11) NOT NULL DEFAULT '0',
  `a_12` int(11) NOT NULL DEFAULT '0',
  `a_13` int(11) NOT NULL DEFAULT '0',
  `a_14` int(11) NOT NULL DEFAULT '0',
  `a_15` int(11) NOT NULL DEFAULT '0',
  `ex_1` int(11) NOT NULL DEFAULT '0',
  `ex_2` int(11) NOT NULL DEFAULT '0',
  `ex_3` int(11) NOT NULL DEFAULT '0',
  `ex_4` int(11) NOT NULL DEFAULT '0',
  `ex_5` int(11) NOT NULL DEFAULT '0',
  `ex_6` int(11) NOT NULL DEFAULT '0',
  `ex_7` int(11) NOT NULL DEFAULT '0',
  `ex_8` int(11) NOT NULL DEFAULT '0',
  `ex_9` int(11) NOT NULL DEFAULT '0',
  `ex_10` int(11) NOT NULL DEFAULT '0',
  `ex_11` int(11) NOT NULL DEFAULT '0',
  `ex_12` int(11) NOT NULL DEFAULT '0',
  `ex_13` int(11) NOT NULL DEFAULT '0',
  `ex_14` int(11) NOT NULL DEFAULT '0',
  `ex_15` int(11) NOT NULL DEFAULT '0',
  `s_1` int(11) NOT NULL DEFAULT '0',
  `s_2` int(11) NOT NULL DEFAULT '0',
  `s_3` int(11) NOT NULL DEFAULT '0',
  `s_4` int(11) NOT NULL DEFAULT '0',
  `s_5` int(11) NOT NULL DEFAULT '0',
  `s_6` int(11) NOT NULL DEFAULT '0',
  `s_7` int(11) NOT NULL DEFAULT '0',
  `s_8` int(11) NOT NULL DEFAULT '0',
  `s_9` int(11) NOT NULL DEFAULT '0',
  `s_10` int(11) NOT NULL DEFAULT '0',
  `s_11` int(11) NOT NULL DEFAULT '0',
  `s_12` int(11) NOT NULL DEFAULT '0',
  `s_13` int(11) NOT NULL DEFAULT '0',
  `s_14` int(11) NOT NULL DEFAULT '0',
  `s_15` int(11) NOT NULL DEFAULT '0',
  `f_1` float NOT NULL,
  `f_2` float NOT NULL,
  `f_3` float NOT NULL,
  `f_4` float NOT NULL,
  `f_5` float NOT NULL,
  `f_6` float NOT NULL,
  `f_7` float NOT NULL,
  `f_8` float NOT NULL,
  `f_9` float NOT NULL,
  `f_10` float NOT NULL,
  `f_11` float NOT NULL,
  `f_12` float NOT NULL,
  `f_13` float NOT NULL,
  `f_14` float NOT NULL,
  `f_15` float NOT NULL,
  `n_1` varchar(32) NOT NULL,
  `n_2` varchar(32) NOT NULL,
  `n_3` varchar(32) NOT NULL,
  `n_4` varchar(32) NOT NULL,
  `n_5` varchar(32) NOT NULL,
  `n_6` varchar(32) NOT NULL,
  `n_7` varchar(32) NOT NULL,
  `n_8` varchar(32) NOT NULL,
  `n_9` varchar(32) NOT NULL,
  `n_10` varchar(32) NOT NULL,
  `n_11` varchar(32) NOT NULL,
  `n_12` varchar(32) NOT NULL,
  `n_13` varchar(32) NOT NULL,
  `n_14` varchar(32) NOT NULL,
  `n_15` varchar(32) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Структура таблицы `jobs`
--

CREATE TABLE IF NOT EXISTS `jobs` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `jobid` int(11) NOT NULL,
  `posx` float NOT NULL,
  `posy` float NOT NULL,
  `posz` float NOT NULL,
  `interior` int(11) NOT NULL,
  `vw` int(11) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 AUTO_INCREMENT=1 ;

-- --------------------------------------------------------

--
-- Структура таблицы `labels`
--

CREATE TABLE IF NOT EXISTS `labels` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `posx` float NOT NULL,
  `posy` float NOT NULL,
  `posz` float NOT NULL,
  `color` int(11) NOT NULL,
  `vw` int(11) NOT NULL,
  `labeltext` varchar(128) NOT NULL,
  `gametext` int(11) NOT NULL,
  `pickup` int(11) NOT NULL,
  `interior` int(11) NOT NULL,
  `c_date` varchar(64) NOT NULL,
  `creator` varchar(32) NOT NULL,
  `edited` int(2) NOT NULL,
  `e_date` varchar(64) NOT NULL,
  `editor` varchar(32) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 AUTO_INCREMENT=1 ;

-- --------------------------------------------------------

--
-- Структура таблицы `loginlog`
--

CREATE TABLE IF NOT EXISTS `loginlog` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `accountid` int(11) NOT NULL,
  `date` varchar(24) NOT NULL,
  `ip` varchar(24) NOT NULL,
  `method` varchar(128) NOT NULL,
  `platform` varchar(64) NOT NULL DEFAULT 'SA-MP',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 AUTO_INCREMENT=1 ;

-- --------------------------------------------------------

--
-- Структура таблицы `logs`
--

CREATE TABLE IF NOT EXISTS `logs` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `userid` int(11) NOT NULL,
  `secondid` int(11) NOT NULL,
  `text` varchar(256) NOT NULL,
  `type` int(11) NOT NULL,
  `subtype` int(11) NOT NULL,
  `data` varchar(32) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 AUTO_INCREMENT=1 ;

-- --------------------------------------------------------

--
-- Структура таблицы `logs_exit`
--

CREATE TABLE IF NOT EXISTS `logs_exit` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `date` varchar(24) NOT NULL,
  `reason_0` int(11) NOT NULL DEFAULT '0',
  `reason_1` int(11) NOT NULL DEFAULT '0',
  `reason_2` int(11) NOT NULL DEFAULT '0',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 AUTO_INCREMENT=1 ;

-- --------------------------------------------------------

--
-- Структура таблицы `marks`
--

CREATE TABLE IF NOT EXISTS `marks` (
  `id` int(11) NOT NULL,
  `text` varchar(196) NOT NULL,
  `creator` varchar(32) NOT NULL,
  `c_date` varchar(64) NOT NULL,
  `posx` float NOT NULL,
  `posy` float NOT NULL,
  `posz` float NOT NULL,
  `interior` int(11) NOT NULL,
  `world` int(11) NOT NULL,
  UNIQUE KEY `id` (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Структура таблицы `objects`
--

CREATE TABLE IF NOT EXISTS `objects` (
  `id` int(10) NOT NULL AUTO_INCREMENT,
  `model` int(10) NOT NULL,
  `posx` float NOT NULL,
  `posy` float NOT NULL,
  `posz` float NOT NULL,
  `posrx` float NOT NULL,
  `posry` float NOT NULL,
  `posrz` float NOT NULL,
  `interior` int(4) NOT NULL,
  `virworld` int(4) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 AUTO_INCREMENT=1 ;

-- --------------------------------------------------------

--
-- Структура таблицы `objects_texture`
--

CREATE TABLE IF NOT EXISTS `objects_texture` (
  `objectid` int(11) NOT NULL,
  `slot` int(11) NOT NULL,
  `model` int(11) NOT NULL,
  `txd_name` varchar(32) NOT NULL,
  `texture_name` varchar(32) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Структура таблицы `ooc_news`
--

CREATE TABLE IF NOT EXISTS `ooc_news` (
  `link` varchar(126) NOT NULL,
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `date` int(11) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=cp1251 AUTO_INCREMENT=1 ;

-- --------------------------------------------------------

--
-- Структура таблицы `payphones`
--

CREATE TABLE IF NOT EXISTS `payphones` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `type` int(11) NOT NULL,
  `number` int(11) NOT NULL,
  `x` float NOT NULL,
  `y` float NOT NULL,
  `z` float NOT NULL,
  `rx` float NOT NULL,
  `ry` float NOT NULL,
  `rz` float NOT NULL,
  `vw` int(11) NOT NULL,
  `int` int(11) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 AUTO_INCREMENT=1 ;

-- --------------------------------------------------------

--
-- Структура таблицы `plants`
--

CREATE TABLE IF NOT EXISTS `plants` (
  `id` int(10) NOT NULL AUTO_INCREMENT,
  `type` int(11) NOT NULL,
  `planter` varchar(52) NOT NULL,
  `growtime` int(11) NOT NULL,
  `starttime` int(11) NOT NULL,
  `posx` float NOT NULL,
  `posy` float NOT NULL,
  `posz` float NOT NULL,
  `interior` int(11) NOT NULL,
  `vw` int(11) NOT NULL,
  `c_date` varchar(64) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 AUTO_INCREMENT=1 ;

-- --------------------------------------------------------

--
-- Структура таблицы `player_attach`
--

CREATE TABLE IF NOT EXISTS `player_attach` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `userid` int(11) NOT NULL,
  `name` varchar(24) NOT NULL,
  `model` int(11) NOT NULL,
  `bone` int(11) NOT NULL,
  `offestx` float NOT NULL,
  `offesty` float NOT NULL,
  `offestz` float NOT NULL,
  `rotx` float NOT NULL,
  `roty` float NOT NULL,
  `rotz` float NOT NULL,
  `scalex` float NOT NULL,
  `scaley` float NOT NULL,
  `scalez` float NOT NULL,
  `used` tinyint(1) NOT NULL DEFAULT '1',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 AUTO_INCREMENT=1 ;

-- --------------------------------------------------------

--
-- Структура таблицы `player_contacts`
--

CREATE TABLE IF NOT EXISTS `player_contacts` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `userid` int(11) NOT NULL,
  `contact` varchar(32) NOT NULL,
  `number` int(11) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 AUTO_INCREMENT=1 ;

-- --------------------------------------------------------

--
-- Структура таблицы `player_music`
--

CREATE TABLE IF NOT EXISTS `player_music` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `userid` int(11) NOT NULL,
  `name` varchar(64) NOT NULL,
  `url` varchar(156) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 AUTO_INCREMENT=1 ;

-- --------------------------------------------------------

--
-- Структура таблицы `player_notes`
--

CREATE TABLE IF NOT EXISTS `player_notes` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `userid` int(11) NOT NULL,
  `text` varchar(128) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 AUTO_INCREMENT=1 ;

-- --------------------------------------------------------

--
-- Структура таблицы `pmeters`
--

CREATE TABLE IF NOT EXISTS `pmeters` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `x` float DEFAULT NULL,
  `y` float DEFAULT NULL,
  `z` float DEFAULT NULL,
  `angle` float DEFAULT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `id` (`id`),
  KEY `id_2` (`id`),
  KEY `id_3` (`id`),
  KEY `id_4` (`id`)
) ENGINE=InnoDB  DEFAULT CHARSET=utf8 AUTO_INCREMENT=17 ;

--
-- Дамп данных таблицы `pmeters`
--

INSERT INTO `pmeters` (`id`, `x`, `y`, `z`, `angle`) VALUES
(1, 1321.54, 265.781, 19.572, 239.565),
(2, 1320.21, 262.777, 19.572, 237.058),
(3, 1318.84, 259.704, 19.572, 248.025),
(4, 1317.41, 256.468, 19.572, 241.445),
(5, 1306.95, 266.463, 19.572, 71.93),
(6, 1305.56, 263.314, 19.572, 69.736),
(7, 1304.12, 260.053, 19.572, 70.676),
(8, 1302.74, 256.901, 19.572, 65.686),
(9, 1366.46, 263.956, 19.567, 245.855),
(10, 1365.03, 260.648, 19.567, 245.469),
(11, 1363.75, 257.583, 19.567, 244.361),
(12, 1357.46, 244.13, 19.567, 245.878),
(13, 1356.09, 240.613, 19.567, 235.851),
(14, 1354.36, 236.658, 19.567, 244.239),
(15, 1239.77, 241.744, 19.555, 247.468),
(16, 1236.76, 234.521, 19.555, 242.165);

-- --------------------------------------------------------

--
-- Структура таблицы `radios`
--

CREATE TABLE IF NOT EXISTS `radios` (
  `id` int(10) NOT NULL AUTO_INCREMENT,
  `channelid` int(11) NOT NULL,
  `owner` int(11) NOT NULL,
  `pass` varchar(32) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 AUTO_INCREMENT=1 ;

-- --------------------------------------------------------

--
-- Структура таблицы `rp_chemical`
--

CREATE TABLE IF NOT EXISTS `rp_chemical` (
  `ID` int(11) NOT NULL AUTO_INCREMENT,
  `Amount` float NOT NULL,
  `Chemical` int(11) NOT NULL,
  `Owner` int(11) NOT NULL,
  PRIMARY KEY (`ID`),
  KEY `ID` (`ID`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 AUTO_INCREMENT=1 ;

-- --------------------------------------------------------

--
-- Структура таблицы `rp_drugs`
--

CREATE TABLE IF NOT EXISTS `rp_drugs` (
  `ID` int(11) NOT NULL AUTO_INCREMENT,
  `Amount` float NOT NULL,
  `Quality` float NOT NULL,
  `Owner` int(11) NOT NULL,
  `EffectTime` int(11) NOT NULL,
  `Addiction` int(11) NOT NULL,
  `Type` int(11) NOT NULL,
  `Name` varchar(128) NOT NULL,
  `CAS` varchar(29) NOT NULL,
  `Creator` varchar(128) NOT NULL,
  PRIMARY KEY (`ID`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 AUTO_INCREMENT=1 ;

-- --------------------------------------------------------

--
-- Структура таблицы `sms`
--

CREATE TABLE IF NOT EXISTS `sms` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `to_name` varchar(26) NOT NULL,
  `from_name` varchar(26) NOT NULL,
  `to_number` int(11) NOT NULL,
  `from_number` int(11) NOT NULL,
  `text` varchar(256) NOT NULL,
  `date` varchar(30) NOT NULL,
  `read` tinyint(1) NOT NULL,
  `archieved` tinyint(1) NOT NULL DEFAULT '0',
  `forward` tinyint(1) NOT NULL DEFAULT '0',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 AUTO_INCREMENT=1 ;

-- --------------------------------------------------------

--
-- Структура таблицы `speedcams`
--

CREATE TABLE IF NOT EXISTS `speedcams` (
  `id` int(2) NOT NULL AUTO_INCREMENT,
  `speed` int(3) NOT NULL,
  `name` varchar(64) NOT NULL,
  `posx` float NOT NULL,
  `posy` float NOT NULL,
  `posz` float NOT NULL,
  `posrx` float NOT NULL,
  `posry` float NOT NULL,
  `posrz` float NOT NULL,
  `interior` int(3) NOT NULL,
  `virworld` int(3) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB  DEFAULT CHARSET=utf8 AUTO_INCREMENT=6 ;

--
-- Дамп данных таблицы `speedcams`
--

INSERT INTO `speedcams` (`id`, `speed`, `name`, `posx`, `posy`, `posz`, `posrx`, `posry`, `posrz`, `interior`, `virworld`) VALUES
(1, 70, 'Red County 120', 502.095, 217.685, 11.855, 0, 0, 0, 0, 0),
(2, 95, 'Red County 120', 501.618, 213.6, 11.95, 0, 0, 136.1, 0, 0),
(3, 95, 'Red County 121', 1027.53, 462.779, 19.004, 0, 0, 153, 0, 0),
(4, 70, 'Montgomery 122', 1414.4, 434.204, 19.103, 0, 0, -80.7, 0, 0),
(5, 95, 'Red County 123', 1997.36, 336.813, 26.962, 0, 0, 69.4, 0, 0);

-- --------------------------------------------------------

--
-- Структура таблицы `streets`
--

CREATE TABLE IF NOT EXISTS `streets` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `dir` varchar(20) NOT NULL,
  `street` varchar(32) NOT NULL,
  `stX` float NOT NULL,
  `stY` float NOT NULL,
  `stZ` float NOT NULL,
  `stRX` float NOT NULL,
  `stRY` float NOT NULL,
  `stRZ` float NOT NULL,
  `nX` float NOT NULL,
  `nY` float NOT NULL,
  `nZ` float NOT NULL,
  `nrX` float NOT NULL,
  `nrY` float NOT NULL,
  `nrZ` float NOT NULL,
  `dX` float NOT NULL,
  `dY` float NOT NULL,
  `dZ` float NOT NULL,
  `drX` float NOT NULL,
  `drY` float NOT NULL,
  `drZ` float NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 AUTO_INCREMENT=1 ;

-- --------------------------------------------------------

--
-- Структура таблицы `tests`
--

CREATE TABLE IF NOT EXISTS `tests` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `text` varchar(526) NOT NULL,
  `ans_1` varchar(256) NOT NULL,
  `ans_2` varchar(128) NOT NULL,
  `ans_3` varchar(128) NOT NULL,
  `ans_4` varchar(128) NOT NULL,
  `right_answer` tinyint(1) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8 AUTO_INCREMENT=1 ;

-- --------------------------------------------------------

--
-- Структура таблицы `tickets`
--

CREATE TABLE IF NOT EXISTS `tickets` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `type` int(11) NOT NULL DEFAULT '0',
  `userid` int(11) NOT NULL DEFAULT '0',
  `vehicle` int(11) NOT NULL DEFAULT '0',
  `officer` varchar(24) NOT NULL DEFAULT 'None',
  `faction` int(11) NOT NULL DEFAULT '0',
  `amount` int(11) NOT NULL DEFAULT '0',
  `reason` varchar(128) NOT NULL DEFAULT 'None',
  `paid` tinyint(1) NOT NULL DEFAULT '0',
  `date` varchar(20) NOT NULL DEFAULT '0000-00-00 00:00:00',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB  DEFAULT CHARSET=utf8 AUTO_INCREMENT=3 ;

--
-- Дамп данных таблицы `tickets`
--

INSERT INTO `tickets` (`id`, `type`, `userid`, `vehicle`, `officer`, `faction`, `amount`, `reason`, `paid`, `date`) VALUES
(1, 0, 0, 32, 'Speed Camera', 3, 500, 'Превышение допустимой скорости.', 0, '20/07/2020, 15:33:55'),
(2, 0, 0, 32, 'Speed Camera', 3, 500, 'Превышение допустимой скорости.', 0, '20/07/2020, 16:36:54');

-- --------------------------------------------------------

--
-- Структура таблицы `towers`
--

CREATE TABLE IF NOT EXISTS `towers` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `x` float NOT NULL,
  `y` float NOT NULL,
  `z` float NOT NULL,
  `rx` float NOT NULL,
  `ry` float NOT NULL,
  `rz` float NOT NULL,
  `model` int(11) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB  DEFAULT CHARSET=utf8 AUTO_INCREMENT=63 ;

--
-- Дамп данных таблицы `towers`
--

INSERT INTO `towers` (`id`, `x`, `y`, `z`, `rx`, `ry`, `rz`, `model`) VALUES
(15, 1629.48, -1988.57, 32.0023, 0, 0, 97.0314, 3763),
(16, 2147.25, -2313.95, 20.1, 0, 0, -134.957, 3763),
(17, 2805.47, -2559.81, 12.8376, 0, 0, -90.2627, 3763),
(18, 2502.4, -1917.61, 24.95, 0, 0, -90.2805, 3763),
(19, 2860.89, -1420.16, 44.6146, 0, 0, 179.361, 3763),
(20, 2707.69, -1337.79, 70.3898, 0, 0, -89.6461, 3763),
(21, 2256.52, -1125.6, 48.15, 0, 0, 161.719, 3763),
(22, 1697.38, -1423.53, 83.9857, 0, 0, 90.0964, 3763),
(23, 914.308, -1021.18, 110.455, 0, 0, -178.841, 3763),
(24, 1055.9, -1554.19, 29.3101, 0, 0, -2.4446, 3763),
(25, 598.788, -1458.58, 79.5563, 0, 0, -0.359749, 3763),
(27, 299.677, -1619.51, 137.722, 0, 0, -102.35, 3763),
(28, 1477.52, -1249.52, 137.18, 0, 0, -178.707, 3763),
(29, 1845.84, -1161.99, 51.27, 0, 0, -90.21, 3763),
(30, 2582.96, -653.575, 159.1, 0, 0, 62.7039, 3763),
(31, 1786.05, -413.295, 108.418, 0, 0, 13.8, 3763),
(32, 580.766, -458.329, 55.7766, 0, 0, 83.9639, 3763),
(33, -45.9324, -251.554, 56.1332, 0, 0, 2.26007, 3763),
(34, 1083.21, 290.004, 48.3642, 0, 0, -8.47071, 3763),
(35, 1653.52, 400.842, 44.514, 0, 0, -16.6142, 3763),
(36, 2669.46, 206.447, 82.5632, 0, 0, 94.5378, 3763),
(37, -593.469, -1772.02, 118.135, 0, 0, 188.015, 3763),
(38, -457.566, -2722.04, 182.351, 0, 0, -75.031, 3763),
(41, -1393.46, -2857.56, 67.273, 0, 0, 157.403, 1),
(42, -2324.52, -2690.78, 65.668, 0, 0, -104.056, 1),
(43, -1469.19, -915.775, 205.559, 0, 0, 7.29, 1),
(44, -2236.19, -55.242, 58.408, 0, 0, -176.152, 1),
(47, -2707.33, 1478.64, 6.568, 0, 0, -1.14, 1),
(48, -2341.94, 2551.17, 28.008, 0, 0, -169.608, 1),
(49, -700.18, 1559.68, 86.242, 0, 0, 354.066, 1),
(50, 150.947, 1606.64, 37.42, 0, 0, 355.586, 1),
(51, 822.649, 1366.43, 38.281, 0, 0, 83.037, 1),
(52, 590.074, 1979.74, 66.383, 0, 0, 265.322, 1),
(53, 1785.27, 2444.96, 14.399, 0, 0, 276.289, 1),
(54, 1578.48, 1893.66, 16.47, 0, 0, 90.707, 1),
(55, 1965.25, 1916.07, 134.908, 0, 0, 276.579, 1),
(56, 2479.02, 2253.14, 91.03, 0, 0, 181.661, 1),
(57, 2533.68, 1625.67, 18.747, 0, 0, -179.842, 1),
(58, 1903.76, 1115.74, 62.286, 0, 0, 90.521, 1),
(59, 2509.95, 1030.76, 56.902, 0, 0, 178.125, 1),
(60, 2623.15, 608.583, 11.289, 0, 0, 181.151, 1),
(61, 1249.35, 686.3, 12, 0, 0, 164.521, 1),
(62, 645.579, -1345.91, 12.947, 0, 0, 296.361, 0);

-- --------------------------------------------------------

--
-- Структура таблицы `trashes`
--

CREATE TABLE IF NOT EXISTS `trashes` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `type` int(11) NOT NULL,
  `x` float NOT NULL,
  `y` float NOT NULL,
  `z` float NOT NULL,
  `rz` float NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB  DEFAULT CHARSET=utf8 AUTO_INCREMENT=9 ;

--
-- Дамп данных таблицы `trashes`
--

INSERT INTO `trashes` (`id`, `type`, `x`, `y`, `z`, `rz`) VALUES
(1, 1, -159.633, 1086.29, 19.542, -90.2),
(2, 1, -326.215, 1054.06, 19.532, -179.5),
(3, 1, 2273.57, -64.011, 26.322, 0.7),
(4, 1, 2313.73, -72.394, 26.264, 0),
(5, 1, -165.052, 1127.62, 19.552, 0),
(6, 1, -161.605, 1181, 19.552, 0),
(7, 1, -90.587, 1125.86, 19.522, 90.7),
(8, 1, -22.049, 1160.22, 19.178, 0);

-- --------------------------------------------------------

--
-- Структура таблицы `truck_cargo`
--

CREATE TABLE IF NOT EXISTS `truck_cargo` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `type` int(11) NOT NULL,
  `name` varchar(64) NOT NULL,
  `storage` int(11) NOT NULL,
  `storage_size` int(11) NOT NULL,
  `price` int(11) NOT NULL,
  `product_id` int(11) NOT NULL,
  `product_amount` int(11) NOT NULL,
  `pack` int(11) NOT NULL,
  `x` float NOT NULL,
  `y` float NOT NULL,
  `z` float NOT NULL,
  `locked` tinyint(1) NOT NULL,
  `gps` int(11) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB  DEFAULT CHARSET=utf8 AUTO_INCREMENT=143 ;

--
-- Дамп данных таблицы `truck_cargo`
--

INSERT INTO `truck_cargo` (`id`, `type`, `name`, `storage`, `storage_size`, `price`, `product_id`, `product_amount`, `pack`, `x`, `y`, `z`, `locked`, `gps`) VALUES
(66, 2, 'The Ship', 0, 200, 100, 0, 0, 0, 2775.92, -2389.29, 13.633, 0, 0),
(67, 2, 'The Ship', 0, 200, 100, 4, 0, 0, 2795.67, -2389.59, 13.632, 0, 0),
(68, 2, 'The Ship', 0, 200, 100, 22, 0, 0, 2824.05, -2397.67, 12.08, 0, 0),
(69, 2, 'The Ship', 0, 200, 100, 5, 0, 0, 2823.79, -2407.12, 12.082, 0, 0),
(70, 2, 'The Ship', 0, 200, 100, 1, 0, 0, 2823.51, -2419.55, 12.085, 0, 0),
(71, 2, 'The Ship', 0, 200, 100, 2, 0, 0, 2823.42, -2430.19, 12.088, 0, 0),
(72, 2, 'The Ship', 0, 200, 100, 23, 0, 0, 2823.42, -2441.07, 12.09, 0, 0),
(73, 2, 'The Ship', 0, 200, 100, 3, 0, 0, 2823.59, -2456.83, 12.094, 0, 0),
(74, 3, 'Лесопилка Angel Pine', 10, 200, 1350, 17, -10, 1, -1971, -2431.89, 30.625, 0, 0),
(75, 1, 'Лесопилка Angel Pine', 100, 200, 50, 15, 5, 1, -1997.86, -2414.99, 30.625, 0, 1),
(76, 1, 'Лесопилка Angel Pine', 0, 200, 50, 5, 5, 1, -2003.22, -2410.02, 30.625, 0, 0),
(77, 0, 'Свалка Whetstone', 39, 200, 50, 19, 5, 0, -1894.08, -1671.33, 23.016, 0, 1),
(78, 0, 'Ферма Whetstone', 100, 200, 50, 8, 5, 15, -1447.54, -1523.08, 101.758, 0, 1),
(79, 0, 'Ферма Whetstone', 100, 200, 50, 10, 5, 15, -1446.49, -1499.92, 101.758, 0, 0),
(80, 0, 'Фруктовый сад Flint', 194, 200, 50, 24, 6, 0, -1098.92, -1636.62, 76.367, 0, 1),
(84, 0, 'Ферма Flint', 100, 200, 50, 10, 4, 16, -381.972, -1426.46, 26.067, 0, 0),
(85, 0, 'Ферма Flint', 199, 200, 50, 7, 4, 16, -382.22, -1438.87, 25.727, 0, 0),
(86, 0, 'Ферма Flint', 197, 200, 50, 6, 4, 16, -372.704, -1427.95, 25.727, 0, 1),
(87, 0, 'Химзавод Easter Bay', 97, 200, 50, 18, 4, 18, -1037.32, -685.767, 32.013, 0, 0),
(88, 0, 'Химзавод Easter Bay', 158, 200, 50, 11, 4, 18, -1024.16, -685.337, 32.008, 0, 1),
(90, 0, 'Лесопилка Panopticon (Восток)', 199, 200, 900, 17, 2, 0, -491.43, -193.335, 78.337, 0, 1),
(91, 0, 'Лесопилка Panopticon (Запад)', 104, 200, 900, 17, 2, 0, -762.026, -106.222, 65.853, 0, 1),
(92, 0, 'Ферма Blueberry ', 29, 200, 50, 8, 3, 19, -67.507, -33.591, 3.117, 0, 0),
(93, 0, 'Ферма Blueberry ', 40, 200, 50, 9, 3, 19, -85.957, 2.515, 3.117, 0, 0),
(94, 0, 'Ферма Blueberry ', 159, 200, 50, 6, 3, 19, -90.939, -10.209, 3.109, 0, 1),
(95, 0, 'Ферма Dillimore', 186, 200, 50, 6, 3, 17, 1059.75, -345.093, 73.992, 0, 0),
(96, 0, 'Ферма Dillimore', 100, 200, 50, 8, 3, 17, 1081.14, -344.977, 73.98, 0, 0),
(97, 0, 'Ферма Dillimore', 161, 200, 50, 7, 3, 17, 1051.93, -345.607, 73.992, 0, 1),
(99, 0, 'Ферма Palomino Creek', 50, 200, 55, 9, 5, 0, 1938.68, 165.846, 37.281, 0, 1),
(100, 0, 'Карьер Fort Carson', 170, 200, 50, 16, 10, 0, 355.884, 849.751, 20.117, 0, 1),
(101, 0, 'Нефтезавод Green Palms', 50, 200, 50, 0, 15, 0, 257.364, 1395.99, 10.586, 0, 1),
(105, 3, 'Строительная площадка Doherty', 100, 200, 50, 22, -4, 14, -2073.09, 230.65, 35.863, 0, 1),
(106, 3, 'Строительная площадка Rockshore', 1, 200, 130, 22, -4, 13, 2702.73, 897.734, 10.244, 0, 1),
(109, 1, 'Бетонный завод Ocean Docks', 199, 200, 70, 22, 6, 3, 2460.6, -2119.11, 13.553, 0, 1),
(110, 3, 'Бетонный завод Ocean Docks', 133, 200, 120, 16, -6, 3, 2484.77, -2119.67, 13.547, 0, 1),
(111, 1, 'Металлургический завод San Andreas', 4, 200, 50, 20, 5, 4, 2668.07, -1444.18, 30.53, 0, 1),
(112, 3, 'Металлургический завод San Andreas', 145, 200, 100, 19, -5, 4, 2669.49, -1458.69, 30.55, 0, 0),
(113, 1, 'Текстильная фабрика Doherty', 150, 200, 50, 3, 5, 5, -2137.13, -247.918, 36.516, 0, 1),
(114, 3, 'Текстильная фабрика Doherty', 100, 200, 50, 11, -2, 5, -2125.25, -264.019, 35.32, 0, 0),
(115, 3, 'Текстильная фабрика Doherty', 100, 200, 50, 10, -3, 5, -2178.49, -209.374, 36.516, 0, 0),
(117, 3, 'Solarin Autos', 58, 200, 125, 20, -6, 6, -1847.08, 111.448, 15.117, 0, 0),
(119, 3, 'Solarin Autos', 100, 200, 95, 11, -4, 6, -1857.87, 111.506, 15.117, 0, 0),
(120, 1, 'Solarin Autos', 100, 200, 2000, 4, 2, 6, -1836.65, 111.398, 15.117, 0, 1),
(121, 1, 'Пивоварня Blueberry', 10, 200, 50, 2, 4, 7, -158.096, -289.249, 3.905, 0, 1),
(122, 3, 'Пивоварня Blueberry', 180, 200, 120, 13, -4, 7, -116.964, -314.521, 2.765, 0, 0),
(123, 1, 'Винокурня Fort Carson', 196, 200, 50, 2, 5, 8, -135.278, 1116.64, 20.197, 0, 1),
(124, 3, 'Винокурня Fort Carson', 200, 200, 90, 24, -5, 8, -116.885, 1132.73, 19.742, 0, 0),
(125, 3, 'Приборостроение Shafted', 5, 200, 50, 20, -5, 9, 1696.98, 915.941, 10.815, 0, 0),
(126, 1, 'Приборостроение Shafted', 0, 200, 50, 23, 5, 9, 1681.11, 915.665, 10.757, 0, 1),
(132, 1, 'Производство пищевых продуктов', 119, 200, 50, 1, 10, 10, 1053.5, 2148.28, 10.82, 0, 1),
(133, 3, 'Производство пищевых продуктов', 200, 200, 100, 8, -2, 10, 1053.54, 2086.95, 10.82, 0, 0),
(134, 3, 'Производство пищевых продуктов', 194, 200, 100, 6, -2, 10, 1053.5, 2105.91, 10.82, 0, 0),
(135, 3, 'Производство пищевых продуктов', 199, 200, 100, 7, -2, 10, 1053.45, 2114.76, 10.82, 0, 0),
(136, 3, 'Производство пищевых продуктов', 200, 200, 100, 9, -2, 10, 1053.38, 2129.22, 10.82, 0, 0),
(137, 3, 'Производство пищевых продуктов', 132, 200, 100, 24, -2, 10, 1053.33, 2137.25, 10.82, 0, 0),
(138, 1, 'Федеральный Оружейный завод', 178, 200, 350, 21, 6, 11, 2537.01, 2823.62, 10.82, 0, 1),
(139, 3, 'Федеральный Оружейный завод', 3, 200, 95, 20, -3, 11, 2510.22, 2802.99, 10.82, 0, 0),
(140, 3, 'Федеральный Оружейный завод', 199, 200, 120, 18, -3, 11, 2510.01, 2818.13, 10.82, 0, 0),
(141, 3, 'Солодовая Bone', 130, 200, 120, 9, -5, 12, -301.239, 2662.19, 62.753, 0, 0),
(142, 1, 'Солодовая Bone', 60, 200, 50, 13, 5, 12, -318.37, 2659, 63.869, 0, 1);

-- --------------------------------------------------------

--
-- Структура таблицы `users`
--

CREATE TABLE IF NOT EXISTS `users` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `accountid` int(11) NOT NULL,
  `name` varchar(24) NOT NULL,
  `status` tinyint(1) NOT NULL DEFAULT '0',
  `online` int(11) NOT NULL,
  `cash` int(11) NOT NULL DEFAULT '2500',
  `bank` int(11) NOT NULL DEFAULT '10000',
  `skin` int(11) NOT NULL,
  `sex` int(11) NOT NULL,
  `origin` varchar(56) NOT NULL,
  `birthdate` varchar(24) NOT NULL,
  `level` int(11) NOT NULL,
  `exp` int(11) NOT NULL,
  `hours` int(11) NOT NULL,
  `admin_hide` tinyint(1) NOT NULL,
  `int` int(11) NOT NULL,
  `world` int(11) NOT NULL,
  `ajailed` int(11) NOT NULL,
  `ajailtime` int(11) NOT NULL,
  `jailed` int(11) NOT NULL,
  `isolatetime` int(11) NOT NULL,
  `warns` int(11) NOT NULL,
  `vip` int(11) NOT NULL,
  `vip_time` int(11) NOT NULL,
  `carlic` int(1) NOT NULL,
  `weplic` int(1) NOT NULL,
  `flylic` int(1) NOT NULL,
  `taxilic` int(1) NOT NULL,
  `deathreason` int(11) NOT NULL,
  `fightstyle` int(11) NOT NULL DEFAULT '4',
  `hud` int(1) NOT NULL DEFAULT '1',
  `paycheck` int(11) NOT NULL,
  `fishcount` int(11) NOT NULL DEFAULT '0',
  `paydaytime` int(64) NOT NULL,
  `spawnhealth` float NOT NULL DEFAULT '75',
  `number` int(11) NOT NULL,
  `savings` int(11) NOT NULL,
  `rent_key` int(11) NOT NULL,
  `rent_price` int(11) NOT NULL,
  `crashed` tinyint(4) NOT NULL,
  `mutetime` int(11) DEFAULT '0',
  `sparekey` int(11) NOT NULL,
  `workon` int(11) NOT NULL,
  `position` varchar(24) NOT NULL,
  `walk` int(11) NOT NULL,
  `health` float NOT NULL,
  `armour` float NOT NULL,
  `faction` int(11) NOT NULL,
  `rank` int(11) NOT NULL,
  `badgenumber` int(11) NOT NULL,
  `drivewarns` int(11) NOT NULL,
  `jailtime` int(11) NOT NULL,
  `arrested` int(11) NOT NULL,
  `chat` int(11) NOT NULL,
  `swat` int(11) NOT NULL,
  `swat_duty` int(1) NOT NULL,
  `job` int(11) NOT NULL,
  `jobrank` int(11) NOT NULL,
  `career` int(11) NOT NULL,
  `sidejob` int(11) NOT NULL,
  `spawntype` int(11) NOT NULL DEFAULT '0',
  `10minspawn` int(3) NOT NULL,
  `pos_X` float(5,1) NOT NULL DEFAULT '2269.5',
  `pos_Y` float(5,1) NOT NULL DEFAULT '-81.2',
  `pos_Z` float(5,1) NOT NULL DEFAULT '26.5',
  `pos_A` float(5,1) NOT NULL DEFAULT '184.9',
  `prisoned` int(11) NOT NULL,
  `slot` int(11) NOT NULL,
  `injured` tinyint(1) NOT NULL,
  `gunjob` int(1) NOT NULL,
  `duty` int(1) NOT NULL,
  `char` int(3) NOT NULL,
  `weap_0_bone` int(11) NOT NULL DEFAULT '1',
  `weap_0_x` float NOT NULL DEFAULT '0.323999',
  `weap_0_y` float NOT NULL DEFAULT '-0.144999',
  `weap_0_z` float NOT NULL DEFAULT '-0.166',
  `weap_0_rx` float NOT NULL DEFAULT '0',
  `weap_0_ry` float NOT NULL DEFAULT '-72',
  `weap_0_rz` float NOT NULL DEFAULT '0',
  `weap_1_bone` int(11) NOT NULL DEFAULT '8',
  `weap_1_x` float NOT NULL DEFAULT '-0.239',
  `weap_1_y` float NOT NULL DEFAULT '-0.062999',
  `weap_1_z` float NOT NULL DEFAULT '0.079999',
  `weap_1_rx` float NOT NULL DEFAULT '-97.2',
  `weap_1_ry` float NOT NULL DEFAULT '-8.1',
  `weap_1_rz` float NOT NULL DEFAULT '-1.7',
  `weap_2_bone` int(11) NOT NULL DEFAULT '1',
  `weap_2_x` float NOT NULL DEFAULT '0.106999',
  `weap_2_y` float NOT NULL DEFAULT '0.207',
  `weap_2_z` float NOT NULL DEFAULT '-0.079',
  `weap_2_rx` float NOT NULL DEFAULT '179.1',
  `weap_2_ry` float NOT NULL DEFAULT '143.1',
  `weap_2_rz` float NOT NULL DEFAULT '-0.099999',
  `upgrade` int(11) NOT NULL DEFAULT '0',
  `channel` int(11) NOT NULL,
  `owned_channel` int(11) NOT NULL,
  `tog_0` int(11) NOT NULL,
  `tog_1` int(11) NOT NULL,
  `tog_2` int(11) NOT NULL,
  `authed` tinyint(1) NOT NULL,
  `phone_off` tinyint(1) NOT NULL,
  `phone_airplane` tinyint(1) NOT NULL,
  `phone_model` tinyint(1) NOT NULL,
  `phone_ringtone` tinyint(1) NOT NULL,
  `phone_style` tinyint(1) NOT NULL,
  `phone_sound` tinyint(1) NOT NULL,
  `spawnpoint` tinyint(1) NOT NULL,
  `last_ip` varchar(24) NOT NULL DEFAULT '-',
  `last_login` int(11) NOT NULL DEFAULT '0',
  `admin_name` varchar(24) NOT NULL,
  `reason` varchar(526) NOT NULL,
  `create_date` int(11) NOT NULL,
  `create_ip` varchar(24) NOT NULL,
  `quest3` text NOT NULL,
  `quest4` text NOT NULL,
  `quest5` text NOT NULL,
  `quest6` text NOT NULL,
  `answer1` text NOT NULL,
  `answer2` text,
  `answer3` text NOT NULL,
  `answer4` text NOT NULL,
  `answer5` text NOT NULL,
  `answer6` text NOT NULL,
  `block_name` varchar(24) NOT NULL,
  `block_reason` varchar(64) NOT NULL,
  `settings` int(11) NOT NULL,
  `wepwarns` int(11) NOT NULL,
  `authwep` tinyint(1) NOT NULL,
  `wep_officer` varchar(24) NOT NULL DEFAULT '-',
  `wep_data` varchar(24) NOT NULL DEFAULT '-',
  `wep_price` int(11) NOT NULL,
  `dependence` int(11) NOT NULL DEFAULT '0',
  `demolition` int(11) NOT NULL,
  `ganja_time` int(11) NOT NULL,
  `prescribe` int(11) NOT NULL,
  `fish_time` int(11) NOT NULL,
  `weaphide0` tinyint(1) NOT NULL,
  `weaphide1` tinyint(1) NOT NULL,
  `weaphide2` tinyint(1) NOT NULL,
  `weaplic0` int(11) NOT NULL,
  `weaplic1` int(11) NOT NULL,
  `weaplic2` int(11) NOT NULL,
  `weaplic3` int(11) NOT NULL,
  `copweaplic0` int(11) NOT NULL,
  `copweaplic1` int(11) NOT NULL,
  `copweaplic2` int(11) NOT NULL,
  `copweaplic3` int(11) NOT NULL,
  `wep_count` tinyint(1) NOT NULL,
  `LastPrim` int(6) NOT NULL,
  `LastSec` int(6) NOT NULL,
  `LastMelee` int(6) NOT NULL,
  `Forbid` int(1) NOT NULL,
  `PlayerWeapon` int(11) NOT NULL,
  `PlayerAmmo` int(11) NOT NULL,
  `AmmoType` int(11) NOT NULL,
  `WepSerial` int(11) NOT NULL,
  `PlayerSerial` int(11) NOT NULL,
  `CopItem_1` int(11) NOT NULL,
  `CopAmmo_1` int(11) NOT NULL,
  `CopEx_1` int(11) NOT NULL,
  `CopS_1` int(11) NOT NULL,
  `CopItem_2` int(11) NOT NULL,
  `CopAmmo_2` int(11) NOT NULL,
  `CopEx_2` int(11) NOT NULL,
  `CopS_2` int(11) NOT NULL,
  `CopItem_3` int(11) NOT NULL,
  `CopAmmo_3` int(11) NOT NULL,
  `CopEx_3` int(11) NOT NULL,
  `CopS_3` int(11) NOT NULL,
  `CopItem_4` int(11) NOT NULL,
  `CopAmmo_4` int(11) NOT NULL,
  `CopEx_4` int(11) NOT NULL,
  `CopS_4` int(11) NOT NULL,
  `CopItem_5` int(11) NOT NULL,
  `CopAmmo_5` int(11) NOT NULL,
  `CopEx_5` int(11) NOT NULL,
  `CopS_5` int(11) NOT NULL,
  `Desc1` varchar(80) NOT NULL DEFAULT 'NULL',
  `Desc2` varchar(80) NOT NULL DEFAULT 'NULL',
  `drugaccess` int(1) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 AUTO_INCREMENT=1 ;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
